In [1]:
# Journey North Larva First Sightings

In [2]:
#  Import and read
import pandas as pd 
import numpy as np
import json
# Sue Mottet 2-19-2022

# geoJSONifier

In [3]:
def df_to_geojson(df, properties, lat='latitude', lon='longitude'):
    # create a new python dict to contain our geojson data, using geojson format
    geojson = {'type':'FeatureCollection', 'features':[]}

    # loop through each row in the dataframe and convert each row to geojson format
    for _, row in df.iterrows():
        # create a feature template to fill in
        feature = {'type':'Feature',
                   'properties':{},
                   'geometry':{'type':'Point',
                               'coordinates':[]}}

        # fill in the coordinates
        feature['geometry']['coordinates'] = [row[lon],row[lat]]

        # for each column, get the value and add it as a new feature property
        for prop in properties:
            feature['properties'][prop] = row[prop]
        
        # add this feature (aka, converted dataframe row) to the list of features inside our dict
        geojson['features'].append(feature)
    
    return geojson

# Load file

In [4]:
JNorth1996_2020_df = pd.read_csv("UWMadisonArb_JNorth_Project_MonarchsAndMilkweed_1996-2020.csv")
JNorth1996_2020_df.head()

C:\Users\motte\anaconda3\envs\mlenv\lib\site-packages\IPython\core\interactiveshell.py:3444: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

,id,sighting_date,species,number,latitude,longitude,flag_location,comments,school,grade,image_url,customerid,number_old,flag_number,species_old,flag_species
0,850841703,1996-12-16,Monarch Adult Sighted,1,27.594,-81.362,0,On the ballfield a solitary monarch butterfly ...,Walker memorial junior academy,10.0,-999999.999,135,-999999.999,1,Monarch Butterfly,1
1,851824801,1996-12-06,Monarch Adult Sighted,1,30.420,-87.224,0,Our 5th grade Discovery students who went alon...,Hambrick elementary school,5.0,-999999.999,150,-999999.999,1,Monarch Butterfly,1
2,854409931,1996-09-21,Monarch Adult Sighted,1,40.817,-96.710,0,We saw several hundred monarchs in our school ...,-999999.999,5.0,-999999.999,9701054,-999999.999,1,Monarch Butterfly,1
3,854557206,1996-09-21,Monarch Adult Sighted,1,40.817,-96.710,0,Over a hundered monarchs in our school butterf...,Fredstrom elementary school,6.0,-999999.999,175,-999999.999,1,Monarch Butterfly,1
4,855061862,1997-01-01,Monarch Adult Sighted,1,34.244,-77.946,0,"I Thought I Saw It, But I Was Suprised To See ...",Gregory,3.0,-999999.999,181,-999999.999,1,Monarch Butterfly,1

# Data Exploratory

In [5]:
JNorth1996_2020_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227433 entries, 0 to 227432
Data columns (total 16 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             227433 non-null  int64
 1   sighting_date  227433 non-null  object
 2   species        227433 non-null  object
 3   number         227433 non-null  int64
 4   latitude       227433 non-null  float64
 5   longitude      227433 non-null  float64
 6   flag_location  227433 non-null  int64
 7   comments       227433 non-null  object
 8   school         227433 non-null  object
 9   grade          227433 non-null  float64
 10  image_url      227433 non-null  object
 11  customerid     227433 non-null  int64
 12  number_old     227433 non-null  float64
 13  flag_number    227433 non-null  int64
 14  species_old    227433 non-null  object
 15  flag_species   227433 non-null  int64
dtypes: float64(4), int64(6), object(6)
memory usage: 27.8+ MB

In [6]:
str(JNorth1996_2020_df.columns.tolist())

"['id', 'sighting_date', 'species', 'number', 'latitude', 'longitude', 'flag_location', 'comments', 'school', 'grade', 'image_url', 'customerid', 'number_old', 'flag_number', 'species_old', 'flag_species']"

In [7]:
JNorth1996_2020_df.describe()

,id,number,latitude,longitude,flag_location,grade,customerid,number_old,flag_number,flag_species
count,2.274330e+05,2.274330e+05,227433.000000,227433.000000,227433.000000,227433.000000,2.274330e+05,2.274330e+05,227433.000000,227433.000000
mean,1.420650e+09,1.186529e+02,38.400690,-87.569965,0.598018,-907386.217597,9.451737e+06,-2.844270e+05,0.294816,0.130324
std,1.456887e+08,2.209080e+04,5.268651,10.880362,0.490299,289894.342744,2.193961e+06,4.518136e+05,0.467089,0.336660
min,8.508417e+08,-1.700000e+01,-12.100000,-165.107000,0.000000,-999999.999000,0.000000e+00,-1.000000e+06,0.000000,0.000000
25%,1.377751e+09,1.000000e+00,34.723000,-95.268000,0.000000,-999999.999000,9.941050e+06,-1.000000e+06,0.000000,0.000000
50%,1.477448e+09,1.000000e+00,39.503000,-86.787000,1.000000,-999999.999000,9.977663e+06,1.000000e+00,0.000000,0.000000
75%,1.526383e+09,3.000000e+00,42.409000,-79.255000,1.000000,-999999.999000,1.000029e+07,3.000000e+00,1.000000,0.000000
max,1.526525e+09,1.000000e+07,65.136000,-52.883000,1.000000,1112.000000,1.004256e+07,1.000000e+07,2.000000,1.000000

In [8]:
JNorth1996_2020_df.columns.tolist()

['id',
 'sighting_date',
 'species',
 'number',
 'latitude',
 'longitude',
 'flag_location',
 'comments',
 'school',
 'grade',
 'image_url',
 'customerid',
 'number_old',
 'flag_number',
 'species_old',
 'flag_species']

In [9]:
JNorth1996_2020_df.shape

(227433, 16)

In [10]:
# Determine the number of unique values in each column.
for col in JNorth1996_2020_df:
  print(JNorth1996_2020_df[col].unique())

[ 850841703  851824801  854409931 ... 1526524404 1526524405 1526525021]
['1996-12-16' '1996-12-06' '1996-09-21' ... '2020-12-29' '2020-12-30'
 '2020-12-31']
['Monarch Adult Sighted' 'Monarch Adult (FIRST sighted)'
 'Monarch Egg (FIRST sighted)' 'Monarch (OTHER Observations)'
 'Monarch Larva (FIRST sighted)' 'Monarch PEAK Migration'
 'Milkweed (FIRST sighted)' 'Monarch Fall Roost' 'Monarch Egg Sighted'
 'Monarch Larva Sighted' 'Monarch, Captive-Reared' 'Milkweed Sighted']
[       1      150       20       89       30     2000       50     7500
       23      200        5      300        4      100       71      120
      325       21       28     5000    20000       36       25        6
       54     1000      160       24       60       37        2     3000
  1000000       10  2000000       40       85       65       15        8
      500       14      112       75       80    15000       18    10000
      912   100000      400      800       12       35      600       16
    25000     1500     1117       70        3      463       45       72
      250      182       56       26    30000     2500     8000      750
      700       46      556       34      275       53       22      650
      210      224     1100      240   200000      900     1200        7
       13      115       11       19      810       66       43      510
        9       62       27      290      104       44      440      202
       55      180       17      140      269       61      142      175
       41      123       32       76       31      195      125       29
      164      109      119      105     4000       69      360       88
       58      239       48      310      117       52      261       90
      135      296      211       39       51      102     7001      127
       49       47       33     1300       42      101     5075     1520
      170       81      190       38      110      558      381      228
      248       86       74      172      230      420     2806       94
       92      118      425     5400     6300       68       79    50000
     2300     7000       84      128       57      350       83      124
      114      450      147      501       87       77      197      840
    13460     3500       64       73      178      265      151      133
      121      477       59       97      850      130      165       95
      383       98      729      222      116      225       63     6000
      475    34000    13420    21329    12073    16244    30293    11082
       78      214      113      108      280      212      138      285
      229      216      720      206      606      287      107      134
      157      540 10000000      220      103      270       82      139
      318       93       67      181      122      158      156      232
      106      155     2400      667     1286      179      349      207
      505      132      154     1400    32914    29804    18128    15890
     7750     8531     7333     7783      173      213      126      378
      417      481      780     4800      625      208      205      145
      260      193      144      227      305      831      289      246
      404      152       96      373      855     1800      519      215
      441      337    23800      218      340      231     2100      550
     4500      320     9000    12000      324      461      184      570
      444      620    11000      870      478      252      447      247
      281      980    28073    13492    12864    11472    10200      301
      111      259      171      141      256      186      174      198
      479      187      223      474      203      278      153      257
      520      185     3200      375      258      136    70000    60200
    48000    17800      264    19755    17100    12189    13375      233
      204      192      131       -1      129      149      -17      460
      382      137      143      445       91     1700      330      254
      429      813     2200      316     2600      696      291      255
      286      543      183      251      362      226      453     1080
      860      315      332      244     1351    35000     1503     1125
      725     1482      593     2079    12284    19741    12360    10099
      587    19000   500000      189      671      713     1016      176
      345      219      234      249      409      418    16000     3900
      169     7200      272      284      653      428      348      777
      253       99      201     1516      335      359      356      875
      560      177      525      686     1380      276   999999    12620
     6500     5850      188     2960      480      385      827      323
      148     1012      465      196      162      238      446      313
     2385      307      263      357      163      495     1001      541
      733      167     3600      457     5700     1650     1120     3553
      995     1600     1390      614     7600     8250      314     1580
      221     1620      470      759      267      960     1301      566
      342      880      782      241      514     2250     2470      925
      403      166     6769      146     2469      209      279      868
      585      311      683      354      308      760      387      563
      801      536      161      397      322      613      191     1750
      199      516      321     1850      277      297     4750      370
      489     1149      268     2816      789      430      978      770
      493      716      159]
[27.594 30.42  40.817 ... 30.139 35.008 54.968]
[ -81.362  -87.224  -96.71  ... -118.107 -119.132 -108.727]
[0 1]
['On the ballfield a solitary monarch butterfly flew across the field in a south-west direction at approximately 1:30 pm.'
 'Our 5th grade Discovery students who went along on an overnight field trip to Ft. Pickens, Florida, noticed that there were monarch butterflies all over the grounds of the fort the day they were there (Dec. 6,1996).'
 'We saw several hundred monarchs in our school butterfly garden,  sipping nectar from the New England asters and zinnias.'
 ...
 "There have been at least three Monarchs in my yard this year. I know it's at least three, because I often see all of them at once. But there may be more. I have lived here for 35 years, and an additional 23 years just a mile-and-a-half down the road. This is the first time in decades that I've had Monarchs in my yard, and I've been very excited that they're coming back. I'm hoping to see more in the future. "
 'One larva seen.'
 'Date of last adult sighted.Total sightings were 98 adults from June 3 to Sept. 4.Peak sightings were July 8 to Aug 7.Approx. acreage with milkweed is equal to 4.5Ac. ']
['Walker memorial junior academy' 'Hambrick elementary school'
 '-999999.999' ... 'Homosassa springs wildlife state park'
 'Director, virginia master naturalist program' -999999.999]
[ 1.00000000e+01  5.00000000e+00  6.00000000e+00  3.00000000e+00
  9.00000000e+00 -9.99999999e+05  7.00000000e+00  2.00000000e+00
  8.00000000e+00  9.90000000e+01  4.00000000e+00  1.00000000e+00
  1.20000000e+01  1.10000000e+01  0.00000000e+00  3.40000000e+01
  2.50000000e+01  4.60000000e+01  6.80000000e+01  1.50000000e+01
  9.50000000e+01  3.60000000e+01  1.80000000e+01  2.30000000e+01
  1.40000000e+01  4.50000000e+01  9.12000000e+02  2.40000000e+01
  6.90000000e+01  5.60000000e+01  7.12000000e+02  6.78000000e+02
  1.12000000e+02  4.90000000e+01  7.80000000e+01  6.70000000e+01
  1.30000000e+01  4.56000000e+02  1.90000000e+01  6.12000000e+02
  1.11200000e+03  1.60000000e+01  1.01200000e+03  3.80000000e+01
  6.30000000e+01  2.70000000e+01  1.00000000e+02  9.10000000e+02
  6.20000000e+01  3.11000000e+02  5.80000000e+01  1.70000000e+01
  2.10000000e+01  2.80000000e+01  7.10000000e+01  3.45000000e+02
  1.19000000e+02  3.50000000e+01  4.20000000e+01  6.50000000e+01
  5.00000000e+01  4.12000000e+02  7.90000000e+01  2.00000000e+01
  7.11000000e+02  5.30000000e+01  1.35000000e+02]
['-999999.999'
 'https://journeynorth.org/jnorth/images/userfiles2013/1193346010.jpg'
 'https://www.learner.org/jnorth/images/userfiles/1317067653.jpg' ...
 '//journeynorth.org/jnorth/images/userfiles2021/05/1526513089.jpg'
 '//journeynorth.org/jnorth/images/userfiles2021/05/1526513090.jpg'
 '//journeynorth.org/jnorth/images/userfiles2021/06/1526524404.jpg']
[     135      150  9701054 ... 10042506 10042509 10042557]
[-9.99999999e+05  0.00000000e+00  1.50000000e+02  2.00000000e+01
  8.90000000e+01  3.00000000e+01  2.00000000e+03  5.00000000e+01
  7.50000000e+03  2.30000000e+01  2.00000000e+02  5.00000000e+00
  3.00000000e+02  4.00000000e+00  1.00000000e+02  7.10000000e+01
  1.20000000e+02  3.25000000e+02  2.10000000e+01  2.80000000e+01
  5.00000000e+03  2.00000000e+04  3.60000000e+01  2.50000000e+01
  6.00000000e+00  5.40000000e+01  1.00000000e+03  1.60000000e+02
  2.40000000e+01  6.00000000e+01  3.70000000e+01  2.00000000e+00
  3.00000000e+03  1.00000000e+06  1.00000000e+01  1.00000000e+00
  2.00000000e+06  4.00000000e+01  8.50000000e+01  6.50000000e+01
  1.50000000e+01  8.00000000e+00  5.00000000e+02  1.40000000e+01
  1.12000000e+02  7.50000000e+01  8.00000000e+01  1.50000000e+04
  1.80000000e+01  1.00000000e+04  9.12000000e+02  1.00000000e+05
  4.00000000e+02  8.00000000e+02  1.20000000e+01  3.50000000e+01
  6.00000000e+02  1.60000000e+01  2.50000000e+04  1.50000000e+03
  1.11700000e+03  7.00000000e+01  3.00000000e+00  4.63000000e+02
  4.50000000e+01  7.20000000e+01  2.50000000e+02  1.82000000e+02
  5.60000000e+01  2.60000000e+01  3.00000000e+04  2.50000000e+03
  8.00000000e+03  7.50000000e+02  7.00000000e+02  4.60000000e+01
  5.56000000e+02  3.40000000e+01  2.75000000e+02  5.30000000e+01
  2.20000000e+01  6.50000000e+02  2.10000000e+02  2.24000000e+02
  1.10000000e+03  2.40000000e+02  2.00000000e+05  9.00000000e+02
  1.20000000e+03  7.00000000e+00  1.30000000e+01  1.15000000e+02
  1.10000000e+01  1.90000000e+01  8.10000000e+02  6.60000000e+01
  4.30000000e+01  5.10000000e+02  9.00000000e+00  6.20000000e+01
  2.70000000e+01  2.90000000e+02  1.04000000e+02  4.40000000e+01
  4.40000000e+02  2.02000000e+02  5.50000000e+01  1.80000000e+02
  1.70000000e+01  1.40000000e+02  2.69000000e+02  6.10000000e+01
  1.42000000e+02  1.75000000e+02  4.10000000e+01  1.23000000e+02
  3.20000000e+01  7.60000000e+01  3.10000000e+01  1.95000000e+02
  1.25000000e+02  2.90000000e+01  1.64000000e+02  1.09000000e+02
  1.19000000e+02  1.05000000e+02  4.00000000e+03  6.90000000e+01
  3.60000000e+02  8.80000000e+01  5.80000000e+01  2.39000000e+02
  4.80000000e+01  3.10000000e+02  1.17000000e+02  5.20000000e+01
  2.61000000e+02  9.00000000e+01  1.35000000e+02  2.96000000e+02
  2.11000000e+02  3.90000000e+01  5.10000000e+01  1.02000000e+02
  7.00100000e+03  1.27000000e+02  4.90000000e+01  4.70000000e+01
  3.30000000e+01  1.30000000e+03  4.20000000e+01  1.01000000e+02
  5.07500000e+03  1.52000000e+03  1.70000000e+02  8.10000000e+01
  1.90000000e+02  3.80000000e+01  1.10000000e+02  5.58000000e+02
  3.81000000e+02  2.28000000e+02  2.48000000e+02  8.60000000e+01
  7.40000000e+01  1.72000000e+02  2.30000000e+02  4.20000000e+02
  2.80600000e+03  9.40000000e+01  9.20000000e+01  1.18000000e+02
  4.25000000e+02  5.40000000e+03  6.30000000e+03  6.80000000e+01
  7.90000000e+01  5.00000000e+04  2.30000000e+03  7.00000000e+03
  8.40000000e+01  1.28000000e+02  5.70000000e+01  3.50000000e+02
  8.30000000e+01  1.24000000e+02  1.14000000e+02  4.50000000e+02
  1.47000000e+02  5.01000000e+02  8.70000000e+01  7.70000000e+01
  1.97000000e+02  8.40000000e+02  1.34600000e+04  3.50000000e+03
  6.40000000e+01  7.30000000e+01  1.78000000e+02  2.65000000e+02
  1.51000000e+02  1.33000000e+02  1.21000000e+02  4.77000000e+02
  5.90000000e+01  9.70000000e+01  8.50000000e+02  1.30000000e+02
  1.65000000e+02  9.50000000e+01  3.83000000e+02  9.80000000e+01
  7.29000000e+02  2.22000000e+02  1.16000000e+02  2.25000000e+02
  6.30000000e+01  6.00000000e+03  4.75000000e+02  3.40000000e+04
  1.34200000e+04  2.13290000e+04  1.20730000e+04  1.62440000e+04
  3.02930000e+04  1.10820000e+04  7.80000000e+01  2.14000000e+02
  1.13000000e+02  1.08000000e+02  2.80000000e+02  2.12000000e+02
  1.38000000e+02  2.85000000e+02  2.29000000e+02  2.16000000e+02
  7.20000000e+02  2.06000000e+02  6.06000000e+02  2.87000000e+02
  1.07000000e+02  1.34000000e+02  1.57000000e+02  5.40000000e+02
  1.00000000e+07  2.20000000e+02  1.03000000e+02  2.70000000e+02
  8.20000000e+01  1.39000000e+02  3.18000000e+02  9.30000000e+01
  6.70000000e+01  1.81000000e+02  1.22000000e+02  1.58000000e+02
  1.56000000e+02  2.32000000e+02  1.06000000e+02  1.55000000e+02
  2.40000000e+03  6.67000000e+02  1.28600000e+03  1.79000000e+02
  3.49000000e+02  2.07000000e+02  5.05000000e+02  1.32000000e+02
  1.54000000e+02  1.40000000e+03  3.29140000e+04  2.98040000e+04
  1.81280000e+04  1.58900000e+04  7.75000000e+03  8.53100000e+03
  7.33300000e+03  7.78300000e+03  1.73000000e+02  2.13000000e+02
  1.26000000e+02  3.78000000e+02  4.17000000e+02  4.81000000e+02
  7.80000000e+02  4.80000000e+03  6.25000000e+02  2.08000000e+02
  2.05000000e+02  1.45000000e+02  2.60000000e+02  1.93000000e+02
  1.44000000e+02  2.27000000e+02  3.05000000e+02  8.31000000e+02
  2.89000000e+02  2.46000000e+02  4.04000000e+02  1.52000000e+02
  9.60000000e+01  3.73000000e+02  8.55000000e+02  1.80000000e+03
  5.19000000e+02  2.15000000e+02  4.41000000e+02  3.37000000e+02
  2.38000000e+04  2.18000000e+02  3.40000000e+02  2.31000000e+02
  2.10000000e+03  5.50000000e+02  4.50000000e+03  3.20000000e+02
  9.00000000e+03  1.20000000e+04  3.24000000e+02  4.61000000e+02
  1.84000000e+02  5.70000000e+02  4.44000000e+02  6.20000000e+02
  1.10000000e+04  8.70000000e+02  4.78000000e+02  2.52000000e+02
  4.47000000e+02  2.47000000e+02  2.81000000e+02  9.80000000e+02
  2.80730000e+04  1.34920000e+04  1.28640000e+04  1.14720000e+04
  1.02000000e+04  3.01000000e+02  1.11000000e+02  2.59000000e+02
  1.71000000e+02  1.41000000e+02  2.56000000e+02  1.86000000e+02
  1.74000000e+02  1.98000000e+02  4.79000000e+02  1.87000000e+02
  2.23000000e+02  4.74000000e+02  2.03000000e+02  2.78000000e+02
  1.53000000e+02  2.57000000e+02  5.20000000e+02  1.85000000e+02
  3.20000000e+03  3.75000000e+02  2.58000000e+02  1.36000000e+02
  7.00000000e+04  6.02000000e+04  4.80000000e+04  1.78000000e+04
  2.64000000e+02  1.97550000e+04  1.71000000e+04  1.21890000e+04
  1.33750000e+04  2.33000000e+02  2.04000000e+02  1.92000000e+02
  1.31000000e+02 -1.00000000e+00  1.29000000e+02  1.49000000e+02
 -1.70000000e+01  4.60000000e+02  3.82000000e+02  1.37000000e+02
  1.43000000e+02  4.45000000e+02  9.10000000e+01  1.70000000e+03
  3.30000000e+02  2.54000000e+02  4.29000000e+02  8.13000000e+02
  2.20000000e+03  3.16000000e+02  2.60000000e+03  6.96000000e+02
  2.91000000e+02  2.55000000e+02  2.86000000e+02  5.43000000e+02
  1.83000000e+02  2.51000000e+02  3.62000000e+02  2.26000000e+02
  4.53000000e+02  1.08000000e+03  8.60000000e+02  3.15000000e+02
  3.32000000e+02  2.44000000e+02  1.35100000e+03  3.50000000e+04
  1.50300000e+03  1.12500000e+03  7.25000000e+02  1.48200000e+03
  5.93000000e+02  2.07900000e+03  1.22840000e+04  1.97410000e+04
  1.23600000e+04  1.00990000e+04  5.87000000e+02  1.90000000e+04
  5.00000000e+05  1.89000000e+02  6.71000000e+02  7.13000000e+02
  1.01600000e+03  1.76000000e+02  3.45000000e+02  2.19000000e+02
  2.34000000e+02  2.49000000e+02  4.09000000e+02  4.18000000e+02
  1.60000000e+04  3.90000000e+03  1.69000000e+02  7.20000000e+03
  2.72000000e+02  2.84000000e+02  6.53000000e+02  4.28000000e+02
  3.48000000e+02  7.77000000e+02  2.53000000e+02  9.90000000e+01
  2.01000000e+02  1.51600000e+03  3.35000000e+02  3.59000000e+02
  3.56000000e+02  8.75000000e+02  5.60000000e+02  1.77000000e+02
  5.25000000e+02  6.86000000e+02  1.38000000e+03  2.76000000e+02
  9.99999000e+05  1.26200000e+04  6.50000000e+03  5.85000000e+03
  1.88000000e+02  2.96000000e+03  4.80000000e+02  3.85000000e+02
  8.27000000e+02  3.23000000e+02  1.48000000e+02  1.01200000e+03
  4.65000000e+02  1.96000000e+02  1.62000000e+02  2.38000000e+02
  4.46000000e+02  3.13000000e+02  2.38500000e+03  3.07000000e+02
  2.63000000e+02  3.57000000e+02  1.63000000e+02  4.95000000e+02
  1.00100000e+03  5.41000000e+02  7.33000000e+02  1.67000000e+02
  3.60000000e+03  4.57000000e+02  5.70000000e+03  1.65000000e+03
  1.12000000e+03  3.55300000e+03  9.95000000e+02  1.60000000e+03
  1.39000000e+03  6.14000000e+02  7.60000000e+03  8.25000000e+03
  3.14000000e+02  1.58000000e+03  2.21000000e+02  1.62000000e+03
  4.70000000e+02  7.59000000e+02  2.67000000e+02  9.60000000e+02
  1.30100000e+03  5.66000000e+02  3.42000000e+02  8.80000000e+02
  7.82000000e+02  2.41000000e+02  5.14000000e+02  2.25000000e+03
  2.47000000e+03  9.25000000e+02  4.03000000e+02  1.66000000e+02
  6.76900000e+03  1.46000000e+02  2.46900000e+03  2.09000000e+02
  2.79000000e+02  8.68000000e+02  5.85000000e+02  3.11000000e+02
  6.83000000e+02  3.54000000e+02  3.08000000e+02  7.60000000e+02
  3.87000000e+02  5.63000000e+02  8.01000000e+02  5.36000000e+02
  1.61000000e+02  3.97000000e+02  3.22000000e+02  6.13000000e+02
  1.91000000e+02  1.75000000e+03  1.99000000e+02  5.16000000e+02
  3.21000000e+02  1.85000000e+03  2.77000000e+02  2.97000000e+02
  4.75000000e+03  3.70000000e+02  4.89000000e+02  1.14900000e+03
  2.68000000e+02  2.81600000e+03  7.89000000e+02  4.30000000e+02
  9.78000000e+02  7.70000000e+02  4.93000000e+02  7.16000000e+02
  1.59000000e+02]
[1 2 0]
['Monarch Butterfly' 'Monarch Migration' 'FIRST Monarch Butterfly'
 'FIRST Monarch Egg' 'First Monarch' 'FIRST Monarch' 'LAST Fall Monarch'
 'Monarch (OTHER observations)' 'Monarch (FIRST sighting)'
 'Monarch (FIRST seen)' 'Monarch (Other Sightings)'
 'Monarch (OTHER observation)' 'Monarch (OTHER Observation)'
 'Monarch Migration Sighting' 'Monarch (OTHER Observations)'
 'Monarch Migration Study' 'LAST Fall Monarch Sighted'
 ' LAST Fall Monarch Sighted' 'LAST Fall Monarch Migration'
 'Monarch (OTHER oservations)' 'Monarch (LAST sighting)'
 'Monarch Larva (FIRST sighted)' 'Monarch Egg (FIRST sighted)'
 'Monarch Adult (FIRST sighted)' 'Monarch Adult (FIRST Sighted)'
 'Monarch PEAK Migration' 'LAST Fall Monarch Sighting'
 'Monarchs OTHER (Observation)' '(Monarch) Milkweed emerges'
 'Monarch FIRST Migration Sighting' 'Monarch peak Migration'
 'Monarch (OTHER) Observations' 'Milkweed (FIRST Leaves)'
 'Monarch Over-wintering' 'Monarch Adult  (FIRST sighted)'
 'Monarchs (OTHER observations)' 'Monarch (IOTHER observations)'
 'Monarch Fall Roost' 'Monarch ADULT' 'Monarch Larva (FIRST Sighted)'
 'Monarch (OTHER Observations' 'Monarch Peak Migration'
 'Monarch over-wintering' 'Monarch  Adult (FIRST sighted)'
 'Monarch (Other Observations)' 'Monarch FIRST Adult'
 'Monarch Adult (First sighted)' 'Monarch (Other observations)'
 'Monarch Migration Sighting OW' 'Monarch (FIRST sighted)'
 'Monarch (NONE sighted)' 'Monarch Fall Roost (None yet)'
 'Monarch Adult Sighted' 'Monarch Sighting' 'Monarch (Other Observations'
 'Monarch Winter Sighting' 'Monarch Sighted' 'Monarch Egg Sighted'
 'Monarch Larva Sighted' 'Monarch OTHER Observations'
 'monarch (OTHER Observations)' 'Monarch Egg (FIRST Sighted)'
 'Monarch OW Mexico' 'Monarch Adult  Sighted'
 'Monarch (OTHER Observations) READY' 'Monarch Adult (FIRST sighted))'
 'Monarch, Captive-Reared' 'Monarch Fall Roost (waiting for permission)'
 'Milkweed Sighted' 'Milkweed (FIRST sighted)' 'Milkweed (FIRST Sighted)'
 'Milkweed sighted' 'Monarch, Captive Reared'
 'Monarch Egg (FIRST sighted)ghted)'
 'Monarch Adult (FIRST sighted)T sighted)'
 'Monarch Adult (FIRST sighted)sighted)' 'Monarch (Captive Reared)ed)'
 'Monarch (Captive Reared)' 'Monarch (OTHER Observations)ations)'
 'Monarch Larva Sighted ' 'Monarch Fall Roost ' 'Monarch Egg Sighted '
 'Monarch, captive-Reared' 'MOnarch Larva Sighted'
 'Monarch Adult Sighted ' 'Monarch adult Sighted' 'Monarch Adult SIghted'
 'Monarch Adult (FIRST sighted) ' 'Monarchch Adult Sighted'

In [11]:
# Determine the number of unique values in each column.
for col in JNorth1996_2020_df:
  print(JNorth1996_2020_df[col].value_counts())

850841703     1
1526350827    1
1526350816    1
1526350817    1
1526350818    1
             ..
1432512422    1
1432519704    1
1432562236    1
1432562641    1
1526525021    1
Name: id, Length: 227433, dtype: int64
2018-08-22    392
2018-10-03    377
2018-09-06    353
2019-09-19    337
2018-09-12    335
             ...
2015-12-31      1
2015-11-24      1
2015-11-22      1
2006-07-30      1
1996-12-16      1
Name: sighting_date, Length: 7491, dtype: int64
Monarch Adult Sighted            102306
Monarch Adult (FIRST sighted)     36409
Monarch Larva Sighted             17378
Monarch, Captive-Reared           14339
Monarch (OTHER Observations)      13581
Monarch Egg Sighted                8736
Milkweed (FIRST sighted)           8465
Monarch PEAK Migration             7689
Monarch Egg (FIRST sighted)        6876
Monarch Fall Roost                 5035
Monarch Larva (FIRST sighted)      4898
Milkweed Sighted                   1721
Name: species, dtype: int64
1       139319
2        24169
3        13055
4         7795
5         6118
         ...
860          1
315          1
244          1
1351         1
159          1
Name: number, Length: 555, dtype: int64
29.757    811
30.230    765
45.033    702
37.944    700
42.409    659
         ...
30.770      1
38.355      1
33.305      1
29.930      1
27.594      1
Name: latitude, Length: 18851, dtype: int64
-95.365     807
-97.714     752
-87.405     695
-93.224     620
-82.220     605
           ...
-77.529       1
-69.400       1
-101.051      1
-69.254       1
-122.557      1
Name: longitude, Length: 30123, dtype: int64
1    136009
0     91424
Name: flag_location, dtype: int64
-999999.999                                                                                                                                                               1427
Female                                                                                                                                                                     170
Flying                                                                                                                                                                     144
Male                                                                                                                                                                       118
Recorded as an incidental sighting while conducting surveys on the Fort Hood military base.                                                                                104
                                                                                                                                                                          ...
first female sighting around 3 pm in richmond-laid egg on common milkweed.  Warm sw wind -monarch looked fresh                                                               1
Spotted our first milkweed shoots in our butterfly garden at Lake Anne Elementary this afternoon after the first weekend with warmer temperatures.                           1
Spotted 1 adult near Love Valley Wildlife Reserve near the Red River.                                                                                                        1
Established Asclepias syriaca L. plants in open area have emerged approximately 1 inch in height one day after 0.7" rainfall.                                                1
Date of last adult sighted.Total sightings were 98 adults from June 3 to Sept. 4.Peak sightings were July 8 to Aug 7.Approx. acreage with milkweed is equal to 4.5Ac.        1
Name: comments, Length: 212736, dtype: int64
-999999.999                            139036
-999999.999                             63593
None                                      457
Homeschool                                331
Virginia living museum                    263
                                        ...
William e. norris elementary school         1
Coventry elementary school                  1
Adams is close                              1
Salem elementary school                     1
Walker memorial junior academy              1
Name: school, Length: 6914, dtype: int64
-999999.999    206370
 99.000          3136
 4.000           2947
 3.000           2543
 2.000           2541
                ...
 1012.000           1
 678.000            1
 69.000             1
 95.000             1
 135.000            1
Name: grade, Length: 67, dtype: int64
-999999.999                                                                   183911
//sightings.journeynorth.org/jnorth/images/userfiles2018/09/1526362818.jpg         8
https://journeynorth.org/jnorth/images/userfiles/1366245309.jpg                    3
https://journeynorth.org/jnorth/images/userfiles/1331931236.jpg                    3
//journeynorth.org/jnorth/images/userfiles2020/04/1526445894.jpg                   2
                                                                               ...
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327046.jpg             1
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327055.jpg             1
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327056.jpg             1
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327063.jpg             1
//journeynorth.org/jnorth/images/userfiles2021/06/1526524404.jpg                   1
Name: image_url, Length: 43474, dtype: int64
9710973     7256
9979617     2054
9976074     1055
9975275      900
10010858     757
            ...
9979243        1
9979242        1
9979240        1
9979216        1
10042557       1
Name: customerid, Length: 42518, dtype: int64
 1.000         73436
-999999.999    64715
 2.000         24169
 3.000         13055
 4.000          7795
               ...
 445.000           1
 1700.000          1
 254.000           1
 429.000           1
 159.000           1
Name: number_old, Length: 557, dtype: int64
0    161550
1     64715
2      1168
Name: flag_number, dtype: int64
Monarch Adult Sighted                          91662
Monarch Adult (FIRST sighted)                  25311
Monarch Larva Sighted                          17373
Monarch, Captive-Reared                        14329
Monarch (OTHER Observations)                   10626
                                               ...
monarch (OTHER Observations)                       1
Monarch (OTHER Observations) READY                 1
Monarch Fall Roost (waiting for permission)        1
Monarch, Captive Reared                            1
Monarch, Captive-reared                            1
Name: species_old, Length: 96, dtype: int64
0    197793
1     29640
Name: flag_species, dtype: int64

In [12]:
# Find null values
for column in JNorth1996_2020_df.columns:
   print(f"Column {column} has {JNorth1996_2020_df[column].isnull().sum()} null values")

Column id has 0 null values
Column sighting_date has 0 null values
Column species has 0 null values
Column number has 0 null values
Column latitude has 0 null values
Column longitude has 0 null values
Column flag_location has 0 null values
Column comments has 0 null values
Column school has 0 null values
Column grade has 0 null values
Column image_url has 0 null values
Column customerid has 0 null values
Column number_old has 0 null values
Column flag_number has 0 null values
Column species_old has 0 null values
Column flag_species has 0 null values

In [13]:
# Find duplicate entries
print(f"Duplicate entries: {JNorth1996_2020_df.duplicated().sum()}")

Duplicate entries: 0

In [14]:
# filtering by type of observation (Monarch Larva First Sighted)
JNorth_Larva_First_Site_df = JNorth1996_2020_df[JNorth1996_2020_df['species']=='Monarch Larva (FIRST sighted)']
JNorth_Larva_First_Site_df.head()

,id,sighting_date,species,number,latitude,longitude,flag_location,comments,school,grade,image_url,customerid,number_old,flag_number,species_old,flag_species
2932,946933590,2000-01-02,Monarch Larva (FIRST sighted),1,27.705,-97.348,0,"At Corpus Christi's Hans and Pat Suter Refuge,...",Tamu-cc,-999999.999,-999999.999,9711251,-999999.999,1,Monarch Larva (FIRST sighted),0
2961,951423660,1999-12-01,Monarch Larva (FIRST sighted),1,29.757,-95.365,0,"In Harris County, southwest Houston, I have ha...",-999999.999,-999999.999,-999999.999,9706354,-999999.999,1,Monarch Larva (FIRST sighted),0
2965,951595960,1999-12-15,Monarch Larva (FIRST sighted),1,29.757,-95.365,0,"We have had such a mild winter here, that the ...",-999999.999,-999999.999,-999999.999,9705512,-999999.999,1,Monarch Larva (FIRST sighted),0
2975,952046388,2000-02-01,Monarch Larva (FIRST sighted),1,26.218,-98.238,0,Milam Elementary School (about 10 miles from t...,Ben milam elementary,4.000,-999999.999,1900,-999999.999,1,Monarch Larva (FIRST sighted),0
2977,952110693,2000-03-03,Monarch Larva (FIRST sighted),1,28.807,-96.979,0,We have had a few monarchs all winter in Victo...,Victoria christian school,7.000,-999999.999,9704928,-999999.999,1,Monarch Larva (FIRST sighted),0

In [15]:
JNorth_Larva_First_Site_df.to_csv('JNorth_Larva_First_Site.csv', header=True, mode='w' )

In [16]:
JNorth_Larva_First_Site_df.shape

(4898, 16)

# Format file for geoJSON

In [17]:
JNorth_Larva_First_Site_df = pd.DataFrame(JNorth_Larva_First_Site_df)
JNorth_Larva_First_Site_df.drop(['id','flag_location', 'comments','school','grade','image_url','customerid','number_old','flag_number','species_old','flag_species'], axis=1, inplace=True)
JNorth_Larva_First_Site_df.head()

     sighting_date                        species  number  latitude  longitude
2932    2000-01-02  Monarch Larva (FIRST sighted)       1    27.705    -97.348
2961    1999-12-01  Monarch Larva (FIRST sighted)       1    29.757    -95.365
2965    1999-12-15  Monarch Larva (FIRST sighted)       1    29.757    -95.365
2975    2000-02-01  Monarch Larva (FIRST sighted)       1    26.218    -98.238
2977    2000-03-03  Monarch Larva (FIRST sighted)       1    28.807    -96.979

In [18]:
cols = ['sighting_date', 'species', 'number', 'latitude', 'longitude']

In [19]:
JNorth_Larva_First_Site_df =JNorth_Larva_First_Site_df.groupby(['sighting_date', 'species', 'latitude', 'longitude']).sum().reset_index()
JNorth_Larva_First_Site_df.head()

  sighting_date                        species  latitude  longitude  number
0    1999-12-01  Monarch Larva (FIRST sighted)    29.757    -95.365       1
1    1999-12-15  Monarch Larva (FIRST sighted)    29.757    -95.365       1
2    2000-01-02  Monarch Larva (FIRST sighted)    27.705    -97.348       1
3    2000-02-01  Monarch Larva (FIRST sighted)    26.218    -98.238       1
4    2000-03-03  Monarch Larva (FIRST sighted)    26.218    -98.238       1

In [20]:
JNorth_Larva_First_Site_df.columns.tolist()

['sighting_date', 'species', 'latitude', 'longitude', 'number']

In [21]:
JNorth_Larva_First_Site_df.head()

  sighting_date                        species  latitude  longitude  number
0    1999-12-01  Monarch Larva (FIRST sighted)    29.757    -95.365       1
1    1999-12-15  Monarch Larva (FIRST sighted)    29.757    -95.365       1
2    2000-01-02  Monarch Larva (FIRST sighted)    27.705    -97.348       1
3    2000-02-01  Monarch Larva (FIRST sighted)    26.218    -98.238       1
4    2000-03-03  Monarch Larva (FIRST sighted)    26.218    -98.238       1

In [22]:
JNorth_Larva_First_Site_df.shape

(4830, 5)

In [23]:
JNorth_Larva_First_Site_year_df = JNorth_Larva_First_Site_df
JNorth_Larva_First_Site_year_df['year'] = pd.DatetimeIndex(JNorth_Larva_First_Site_df['sighting_date']).year

# 2001

In [24]:
JNorth_Larva_First_Site_2001_df = JNorth_Larva_First_Site_year_df[JNorth_Larva_First_Site_year_df['year']==2001]
JNorth_Larva_First_Site_2001_df.tail()

,sighting_date,species,latitude,longitude,number,year
63,2001-06-27,Monarch Larva (FIRST sighted),47.368,-97.410,1,2001
64,2001-06-28,Monarch Larva (FIRST sighted),48.252,-96.730,1,2001
65,2001-07-01,Monarch Larva (FIRST sighted),46.548,-90.855,1,2001
66,2001-07-02,Monarch Larva (FIRST sighted),42.430,-86.216,1,2001
67,2001-07-13,Monarch Larva (FIRST sighted),40.047,-76.472,1,2001

In [25]:
JNorth_Larva_First_Site_2001_df.shape

(46, 6)

In [26]:
JNorth_Larva_First_Site_2001_df = pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_df.drop(['year'], axis=1, inplace=True)

In [27]:
JNorth_Larva_First_Site_2001_df['month'] = pd.DatetimeIndex(JNorth_Larva_First_Site_2001_df['sighting_date']).month

## January

In [28]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_1_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==1]
JNorth_Larva_First_Site_2001_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
22,2001-01-13,Monarch Larva (FIRST sighted),29.047,-82.046,1,1

In [29]:
JNorth_Larva_First_Site_2001_1_df.shape

(1, 6)

In [30]:
JNorth_Larva_First_Site_2001_1_df = pd.DataFrame(JNorth_Larva_First_Site_2001_1_df)
JNorth_Larva_First_Site_2001_1_df.drop(['month'], axis=1, inplace=True)

In [31]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_1_df['latitude'] = JNorth_Larva_First_Site_2001_1_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_1_df['longitude'] = JNorth_Larva_First_Site_2001_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [32]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_1_df, cols)

In [33]:
file = open("JNorth_Larva_First_Site_2001_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [34]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_2_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==2]
JNorth_Larva_First_Site_2001_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
23,2001-02-23,Monarch Larva (FIRST sighted),28.529,-96.679,1,2
24,2001-02-23,Monarch Larva (FIRST sighted),29.957,-90.078,1,2
25,2001-02-26,Monarch Larva (FIRST sighted),26.218,-98.238,1,2
26,2001-02-27,Monarch Larva (FIRST sighted),27.954,-82.457,1,2
27,2001-02-27,Monarch Larva (FIRST sighted),39.128,-77.569,1,2

In [35]:
JNorth_Larva_First_Site_2001_2_df.shape

(5, 6)

In [36]:
JNorth_Larva_First_Site_2001_2_df= pd.DataFrame(JNorth_Larva_First_Site_2001_2_df)
JNorth_Larva_First_Site_2001_2_df.drop(['month'], axis=1, inplace=True)

In [37]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_2_df['latitude'] = JNorth_Larva_First_Site_2001_2_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_2_df['longitude'] = JNorth_Larva_First_Site_2001_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [38]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_2_df, cols)

In [39]:
file = open("JNorth_Larva_First_Site_2001_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [40]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_3_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==3]
JNorth_Larva_First_Site_2001_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
28,2001-03-01,Monarch Larva (FIRST sighted),30.230,-97.714,1,3
29,2001-03-06,Monarch Larva (FIRST sighted),26.208,-97.684,1,3
30,2001-03-06,Monarch Larva (FIRST sighted),26.218,-98.238,1,3
31,2001-03-20,Monarch Larva (FIRST sighted),25.778,-80.198,1,3
32,2001-03-22,Monarch Larva (FIRST sighted),26.208,-97.684,1,3

In [41]:
JNorth_Larva_First_Site_2001_3_df.shape

(5, 6)

In [42]:
JNorth_Larva_First_Site_2001_3_df =pd.DataFrame(JNorth_Larva_First_Site_2001_3_df)
JNorth_Larva_First_Site_2001_3_df.drop(['month'], axis=1, inplace=True)

In [43]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_3_df['latitude'] = JNorth_Larva_First_Site_2001_3_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_3_df['longitude'] = JNorth_Larva_First_Site_2001_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [44]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_3_df, cols)

In [45]:
file = open("JNorth_Larva_First_Site_2001_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [46]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_4_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==4]
JNorth_Larva_First_Site_2001_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
42,2001-04-14,Monarch Larva (FIRST sighted),36.405,-86.452,1,4
43,2001-04-16,Monarch Larva (FIRST sighted),30.540,-96.725,1,4
44,2001-04-22,Monarch Larva (FIRST sighted),35.998,-86.787,1,4
45,2001-04-22,Monarch Larva (FIRST sighted),36.070,-79.766,1,4
46,2001-04-29,Monarch Larva (FIRST sighted),26.313,-98.392,1,4

In [47]:
JNorth_Larva_First_Site_2001_4_df.shape

(14, 6)

In [48]:
JNorth_Larva_First_Site_2001_4_df = pd.DataFrame(JNorth_Larva_First_Site_2001_4_df)
JNorth_Larva_First_Site_2001_4_df.drop(['month'], axis=1, inplace=True)

In [49]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_4_df['latitude'] = JNorth_Larva_First_Site_2001_4_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_4_df['longitude'] = JNorth_Larva_First_Site_2001_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [50]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_4_df, cols)

In [51]:
file = open("JNorth_Larva_First_Site_2001_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [52]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_5_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==5]
JNorth_Larva_First_Site_2001_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
48,2001-05-24,Monarch Larva (FIRST sighted),42.733,-86.111,1,5
49,2001-05-28,Monarch Larva (FIRST sighted),40.817,-96.710,1,5
50,2001-05-28,Monarch Larva (FIRST sighted),43.216,-87.957,1,5
51,2001-05-30,Monarch Larva (FIRST sighted),40.817,-96.710,1,5
52,2001-05-31,Monarch Larva (FIRST sighted),43.216,-87.957,1,5

In [53]:
JNorth_Larva_First_Site_2001_5_df.shape

(6, 6)

In [54]:
JNorth_Larva_First_Site_2001_5_df =pd.DataFrame(JNorth_Larva_First_Site_2001_5_df)
JNorth_Larva_First_Site_2001_5_df.drop(['month'], axis=1, inplace=True)

In [55]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_5_df['latitude'] = JNorth_Larva_First_Site_2001_5_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_5_df['longitude'] = JNorth_Larva_First_Site_2001_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [56]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_5_df, cols)

In [57]:
file = open("JNorth_Larva_First_Site_2001_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [58]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_6_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==6]
JNorth_Larva_First_Site_2001_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
60,2001-06-22,Monarch Larva (FIRST sighted),49.531,-96.502,1,6
61,2001-06-23,Monarch Larva (FIRST sighted),44.718,-94.315,1,6
62,2001-06-27,Monarch Larva (FIRST sighted),39.128,-77.569,1,6
63,2001-06-27,Monarch Larva (FIRST sighted),47.368,-97.410,1,6
64,2001-06-28,Monarch Larva (FIRST sighted),48.252,-96.730,1,6

In [59]:
JNorth_Larva_First_Site_2001_6_df.shape

(12, 6)

In [60]:
JNorth_Larva_First_Site_2001_6_df=pd.DataFrame(JNorth_Larva_First_Site_2001_6_df)
JNorth_Larva_First_Site_2001_6_df.drop(['month'], axis=1, inplace=True)

In [61]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_6_df['latitude'] = JNorth_Larva_First_Site_2001_6_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_6_df['longitude'] = JNorth_Larva_First_Site_2001_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [62]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_6_df, cols)

In [63]:
file = open("JNorth_Larva_First_Site_2001_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [64]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_7_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==7]
JNorth_Larva_First_Site_2001_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
65,2001-07-01,Monarch Larva (FIRST sighted),46.548,-90.855,1,7
66,2001-07-02,Monarch Larva (FIRST sighted),42.430,-86.216,1,7
67,2001-07-13,Monarch Larva (FIRST sighted),40.047,-76.472,1,7

In [65]:
JNorth_Larva_First_Site_2001_7_df.shape

(3, 6)

In [66]:
JNorth_Larva_First_Site_2001_7_df = pd.DataFrame(JNorth_Larva_First_Site_2001_7_df)
JNorth_Larva_First_Site_2001_7_df.drop(['month'], axis=1, inplace=True)

In [67]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_7_df['latitude'] = JNorth_Larva_First_Site_2001_7_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_7_df['longitude'] = JNorth_Larva_First_Site_2001_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [68]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_7_df, cols)

In [69]:
file = open("JNorth_Larva_First_Site_2001_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [70]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_8_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==8]
JNorth_Larva_First_Site_2001_8_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [71]:
JNorth_Larva_First_Site_2001_8_df.shape

(0, 6)

In [72]:
JNorth_Larva_First_Site_2001_8_df = pd.DataFrame(JNorth_Larva_First_Site_2001_8_df)
JNorth_Larva_First_Site_2001_8_df.drop(['month'], axis=1, inplace=True)

In [73]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_8_df['latitude'] = JNorth_Larva_First_Site_2001_8_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_8_df['longitude'] = JNorth_Larva_First_Site_2001_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [74]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_8_df, cols)

In [75]:
file = open("JNorth_Larva_First_Site_2001_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [76]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_9_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==9]
JNorth_Larva_First_Site_2001_9_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [77]:
JNorth_Larva_First_Site_2001_9_df.shape

(0, 6)

In [78]:
JNorth_Larva_First_Site_2001_9_df = pd.DataFrame(JNorth_Larva_First_Site_2001_9_df)
JNorth_Larva_First_Site_2001_9_df.drop(['month'], axis=1, inplace=True)

In [79]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_9_df['latitude'] = JNorth_Larva_First_Site_2001_9_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_9_df['longitude'] = JNorth_Larva_First_Site_2001_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [80]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_9_df, cols)

In [81]:
file = open("JNorth_Larva_First_Site_2001_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [82]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_10_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==10]
JNorth_Larva_First_Site_2001_10_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [83]:
JNorth_Larva_First_Site_2001_10_df.shape

(0, 6)

In [84]:
JNorth_Larva_First_Site_2001_10_df = pd.DataFrame(JNorth_Larva_First_Site_2001_10_df)
JNorth_Larva_First_Site_2001_10_df.drop(['month'], axis=1, inplace=True)

In [85]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_10_df['latitude'] = JNorth_Larva_First_Site_2001_10_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_10_df['longitude'] = JNorth_Larva_First_Site_2001_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [86]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_10_df, cols)

In [87]:
file = open("JNorth_Larva_First_Site_2001_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [88]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_11_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==11]
JNorth_Larva_First_Site_2001_11_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [89]:
JNorth_Larva_First_Site_2001_11_df.shape

(0, 6)

In [90]:
JNorth_Larva_First_Site_2001_11_df = pd.DataFrame(JNorth_Larva_First_Site_2001_11_df)
JNorth_Larva_First_Site_2001_11_df.drop(['month'], axis=1, inplace=True)

In [91]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_11_df['latitude'] = JNorth_Larva_First_Site_2001_11_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_11_df['longitude'] = JNorth_Larva_First_Site_2001_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [92]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_11_df, cols)

In [93]:
file = open("JNorth_Larva_First_Site_2001_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [94]:
JNorth_Larva_First_Site_2001_month_df =pd.DataFrame(JNorth_Larva_First_Site_2001_df)
JNorth_Larva_First_Site_2001_12_df = JNorth_Larva_First_Site_2001_month_df[JNorth_Larva_First_Site_2001_month_df['month']==12]
JNorth_Larva_First_Site_2001_12_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [95]:
JNorth_Larva_First_Site_2001_12_df.shape

(0, 6)

In [96]:
JNorth_Larva_First_Site_2001_12_df = pd.DataFrame(JNorth_Larva_First_Site_2001_12_df)
JNorth_Larva_First_Site_2001_12_df.drop(['month'], axis=1, inplace=True)

In [97]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2001_12_df['latitude'] = JNorth_Larva_First_Site_2001_12_df['latitude'].astype(float)
JNorth_Larva_First_Site_2001_12_df['longitude'] = JNorth_Larva_First_Site_2001_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [98]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2001_12_df, cols)

In [99]:
file = open("JNorth_Larva_First_Site_2001_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2002

In [100]:
JNorth_Larva_First_Site_2002_df = JNorth_Larva_First_Site_year_df[JNorth_Larva_First_Site_year_df['year']==2002]
JNorth_Larva_First_Site_2002_df.tail()

,sighting_date,species,latitude,longitude,number,year
105,2002-07-05,Monarch Larva (FIRST sighted),42.172,-87.875,1,2002
106,2002-07-06,Monarch Larva (FIRST sighted),42.626,-87.830,1,2002
107,2002-07-21,Monarch Larva (FIRST sighted),41.461,-85.023,1,2002
108,2002-07-23,Monarch Larva (FIRST sighted),37.235,-76.558,1,2002
109,2002-07-25,Monarch Larva (FIRST sighted),39.969,-82.515,1,2002

In [101]:
JNorth_Larva_First_Site_2002_df.shape

(42, 6)

In [102]:
JNorth_Larva_First_Site_2002_df = pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_df.drop(['year'], axis=1, inplace=True)

In [103]:
JNorth_Larva_First_Site_2002_df.tail

<bound method NDFrame.tail of     sighting_date                        species  latitude  longitude  number
68     2002-01-03  Monarch Larva (FIRST sighted)    29.692    -95.201       1
69     2002-02-02  Monarch Larva (FIRST sighted)    28.542    -81.374       1
70     2002-02-22  Monarch Larva (FIRST sighted)    29.524    -95.535       1
71     2002-03-14  Monarch Larva (FIRST sighted)    26.218    -98.238       1
72     2002-03-17  Monarch Larva (FIRST sighted)    28.711    -81.347       1
73     2002-03-22  Monarch Larva (FIRST sighted)    27.770    -82.637       1
74     2002-03-25  Monarch Larva (FIRST sighted)    30.230    -97.714       1
75     2002-03-27  Monarch Larva (FIRST sighted)    29.081    -97.360       1
76     2002-03-28  Monarch Larva (FIRST sighted)    29.757    -95.365       1
77     2002-03-30  Monarch Larva (FIRST sighted)    27.770    -82.637       1
78     2002-04-02  Monarch Larva (FIRST sighted)    30.610    -96.386       1
79     2002-04-03  Monarch Larva (FIRST sighted)    29.310    -81.152       1
80     2002-04-04  Monarch Larva (FIRST sighted)    32.289    -90.184       1
81     2002-04-12  Monarch Larva (FIRST sighted)    32.645    -97.156       1
82     2002-04-24  Monarch Larva (FIRST sighted)    33.147    -95.929       1
83     2002-04-26  Monarch Larva (FIRST sighted)    38.378    -90.666       1
84     2002-04-30  Monarch Larva (FIRST sighted)    34.564    -83.323       1
85     2002-05-03  Monarch Larva (FIRST sighted)    35.628    -83.784       1
86     2002-05-09  Monarch Larva (FIRST sighted)    30.388    -87.059       1
87     2002-05-10  Monarch Larva (FIRST sighted)    37.832    -78.963       1
88     2002-05-16  Monarch Larva (FIRST sighted)    35.998    -86.787       1
89     2002-05-24  Monarch Larva (FIRST sighted)    40.826    -74.110       1
90     2002-05-27  Monarch Larva (FIRST sighted)    35.999    -78.898       1
91     2002-05-29  Monarch Larva (FIRST sighted)    41.690    -91.452       2
92     2002-05-30  Monarch Larva (FIRST sighted)    41.420    -92.924       1
93     2002-05-31  Monarch Larva (FIRST sighted)    45.226    -94.861       1
94     2002-06-03  Monarch Larva (FIRST sighted)    44.175    -93.226       1
95     2002-06-03  Monarch Larva (FIRST sighted)    47.368    -97.410       1
96     2002-06-05  Monarch Larva (FIRST sighted)    42.248    -85.472       1
97     2002-06-10  Monarch Larva (FIRST sighted)    44.791    -88.624       1
98     2002-06-12  Monarch Larva (FIRST sighted)    40.341    -88.863       1
99     2002-06-12  Monarch Larva (FIRST sighted)    45.080    -79.470       1
100    2002-06-14  Monarch Larva (FIRST sighted)    43.330    -80.150       1
101    2002-06-15  Monarch Larva (FIRST sighted)    42.972    -88.229       1
102    2002-07-03  Monarch Larva (FIRST sighted)    45.030    -78.310       1
103    2002-07-04  Monarch Larva (FIRST sighted)    44.080    -89.310       2
104    2002-07-05  Monarch Larva (FIRST sighted)    41.633    -72.455       1
105    2002-07-05  Monarch Larva (FIRST sighted)    42.172    -87.875       1
106    2002-07-06  Monarch Larva (FIRST sighted)    42.626    -87.830       1
107    2002-07-21  Monarch Larva (FIRST sighted)    41.461    -85.023       1
108    2002-07-23  Monarch Larva (FIRST sighted)    37.235    -76.558       1
109    2002-07-25  Monarch Larva (FIRST sighted)    39.969    -82.515       1>

In [104]:
JNorth_Larva_First_Site_2002_df['month'] = pd.DatetimeIndex(JNorth_Larva_First_Site_2002_df['sighting_date']).month

## January

In [105]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_1_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==1]
JNorth_Larva_First_Site_2002_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
68,2002-01-03,Monarch Larva (FIRST sighted),29.692,-95.201,1,1

In [106]:
JNorth_Larva_First_Site_2002_1_df.shape

(1, 6)

In [107]:
JNorth_Larva_First_Site_2002_1_df = pd.DataFrame(JNorth_Larva_First_Site_2002_1_df)
JNorth_Larva_First_Site_2002_1_df.drop(['month'], axis=1, inplace=True)

In [108]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_1_df['latitude'] = JNorth_Larva_First_Site_2002_1_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_1_df['longitude'] = JNorth_Larva_First_Site_2002_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [109]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_1_df, cols)

In [110]:
file = open("JNorth_Larva_First_Site_2002_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [111]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_2_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==2]
JNorth_Larva_First_Site_2002_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
69,2002-02-02,Monarch Larva (FIRST sighted),28.542,-81.374,1,2
70,2002-02-22,Monarch Larva (FIRST sighted),29.524,-95.535,1,2

In [112]:
JNorth_Larva_First_Site_2002_2_df.shape

(2, 6)

In [113]:
JNorth_Larva_First_Site_2002_2_df = pd.DataFrame(JNorth_Larva_First_Site_2002_2_df)
JNorth_Larva_First_Site_2002_2_df.drop(['month'], axis=1, inplace=True)

In [114]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_2_df['latitude'] = JNorth_Larva_First_Site_2002_2_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_2_df['longitude'] = JNorth_Larva_First_Site_2002_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [115]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_2_df, cols)

In [116]:
file = open("JNorth_Larva_First_Site_2002_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [117]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_3_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==3]
JNorth_Larva_First_Site_2002_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
73,2002-03-22,Monarch Larva (FIRST sighted),27.770,-82.637,1,3
74,2002-03-25,Monarch Larva (FIRST sighted),30.230,-97.714,1,3
75,2002-03-27,Monarch Larva (FIRST sighted),29.081,-97.360,1,3
76,2002-03-28,Monarch Larva (FIRST sighted),29.757,-95.365,1,3
77,2002-03-30,Monarch Larva (FIRST sighted),27.770,-82.637,1,3

In [118]:
JNorth_Larva_First_Site_2002_3_df.shape

(7, 6)

In [119]:
JNorth_Larva_First_Site_2002_3_df = pd.DataFrame(JNorth_Larva_First_Site_2002_3_df)
JNorth_Larva_First_Site_2002_3_df.drop(['month'], axis=1, inplace=True)

In [120]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_3_df['latitude'] = JNorth_Larva_First_Site_2002_3_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_3_df['longitude'] = JNorth_Larva_First_Site_2002_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [121]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_3_df, cols)

In [122]:
file = open("JNorth_Larva_First_Site_2002_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [123]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_4_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==4]
JNorth_Larva_First_Site_2002_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
80,2002-04-04,Monarch Larva (FIRST sighted),32.289,-90.184,1,4
81,2002-04-12,Monarch Larva (FIRST sighted),32.645,-97.156,1,4
82,2002-04-24,Monarch Larva (FIRST sighted),33.147,-95.929,1,4
83,2002-04-26,Monarch Larva (FIRST sighted),38.378,-90.666,1,4
84,2002-04-30,Monarch Larva (FIRST sighted),34.564,-83.323,1,4

In [124]:
JNorth_Larva_First_Site_2002_4_df.shape

(7, 6)

In [125]:
JNorth_Larva_First_Site_2002_4_df = pd.DataFrame(JNorth_Larva_First_Site_2002_4_df)
JNorth_Larva_First_Site_2002_4_df.drop(['month'], axis=1, inplace=True)

In [126]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_4_df['latitude'] = JNorth_Larva_First_Site_2002_4_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_4_df['longitude'] = JNorth_Larva_First_Site_2002_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [127]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_4_df, cols)

In [128]:
file = open("JNorth_Larva_First_Site_2002_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [129]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_5_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==5]
JNorth_Larva_First_Site_2002_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
89,2002-05-24,Monarch Larva (FIRST sighted),40.826,-74.110,1,5
90,2002-05-27,Monarch Larva (FIRST sighted),35.999,-78.898,1,5
91,2002-05-29,Monarch Larva (FIRST sighted),41.690,-91.452,2,5
92,2002-05-30,Monarch Larva (FIRST sighted),41.420,-92.924,1,5
93,2002-05-31,Monarch Larva (FIRST sighted),45.226,-94.861,1,5

In [130]:
JNorth_Larva_First_Site_2002_5_df.shape

(9, 6)

In [131]:
JNorth_Larva_First_Site_2002_5_df = pd.DataFrame(JNorth_Larva_First_Site_2002_5_df)
JNorth_Larva_First_Site_2002_5_df.drop(['month'], axis=1, inplace=True)

In [132]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_5_df['latitude'] = JNorth_Larva_First_Site_2002_5_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_5_df['longitude'] = JNorth_Larva_First_Site_2002_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [133]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_5_df, cols)

In [134]:
file = open("JNorth_Larva_First_Site_2002_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [135]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_6_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==6]
JNorth_Larva_First_Site_2002_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
97,2002-06-10,Monarch Larva (FIRST sighted),44.791,-88.624,1,6
98,2002-06-12,Monarch Larva (FIRST sighted),40.341,-88.863,1,6
99,2002-06-12,Monarch Larva (FIRST sighted),45.080,-79.470,1,6
100,2002-06-14,Monarch Larva (FIRST sighted),43.330,-80.150,1,6
101,2002-06-15,Monarch Larva (FIRST sighted),42.972,-88.229,1,6

In [136]:
JNorth_Larva_First_Site_2002_6_df.shape

(8, 6)

In [137]:
JNorth_Larva_First_Site_2002_6_df = pd.DataFrame(JNorth_Larva_First_Site_2002_6_df)
JNorth_Larva_First_Site_2002_6_df.drop(['month'], axis=1, inplace=True)

In [138]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_6_df['latitude'] = JNorth_Larva_First_Site_2002_6_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_6_df['longitude'] = JNorth_Larva_First_Site_2002_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [139]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_6_df, cols)

In [140]:
file = open("JNorth_Larva_First_Site_2002_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [141]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_7_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==7]
JNorth_Larva_First_Site_2002_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
105,2002-07-05,Monarch Larva (FIRST sighted),42.172,-87.875,1,7
106,2002-07-06,Monarch Larva (FIRST sighted),42.626,-87.830,1,7
107,2002-07-21,Monarch Larva (FIRST sighted),41.461,-85.023,1,7
108,2002-07-23,Monarch Larva (FIRST sighted),37.235,-76.558,1,7
109,2002-07-25,Monarch Larva (FIRST sighted),39.969,-82.515,1,7

In [142]:
JNorth_Larva_First_Site_2002_7_df.shape

(8, 6)

In [143]:
JNorth_Larva_First_Site_2002_7_df = pd.DataFrame(JNorth_Larva_First_Site_2002_7_df)
JNorth_Larva_First_Site_2002_7_df.drop(['month'], axis=1, inplace=True)

In [144]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_7_df['latitude'] = JNorth_Larva_First_Site_2002_7_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_7_df['longitude'] = JNorth_Larva_First_Site_2002_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [145]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_7_df, cols)

In [146]:
file = open("JNorth_Larva_First_Site_2002_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [147]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_8_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==8]
JNorth_Larva_First_Site_2002_8_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [148]:
JNorth_Larva_First_Site_2002_8_df.shape

(0, 6)

In [149]:
JNorth_Larva_First_Site_2002_8_df = pd.DataFrame(JNorth_Larva_First_Site_2002_8_df)
JNorth_Larva_First_Site_2002_8_df.drop(['month'], axis=1, inplace=True)

In [150]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_8_df['latitude'] = JNorth_Larva_First_Site_2002_8_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_8_df['longitude'] = JNorth_Larva_First_Site_2002_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [151]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_8_df, cols)

In [152]:
file = open("JNorth_Larva_First_Site_2002_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [153]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_9_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==9]
JNorth_Larva_First_Site_2002_9_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [154]:
JNorth_Larva_First_Site_2002_9_df.shape

(0, 6)

In [155]:
JNorth_Larva_First_Site_2002_9_df = pd.DataFrame(JNorth_Larva_First_Site_2002_9_df)
JNorth_Larva_First_Site_2002_9_df.drop(['month'], axis=1, inplace=True)

In [156]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_9_df['latitude'] = JNorth_Larva_First_Site_2002_9_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_9_df['longitude'] = JNorth_Larva_First_Site_2002_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [157]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_9_df, cols)

In [158]:
file = open("JNorth_Larva_First_Site_2002_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [159]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_10_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==10]
JNorth_Larva_First_Site_2002_10_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [160]:
JNorth_Larva_First_Site_2002_10_df.shape

(0, 6)

In [161]:
JNorth_Larva_First_Site_2002_10_df = pd.DataFrame(JNorth_Larva_First_Site_2002_10_df)
JNorth_Larva_First_Site_2002_10_df.drop(['month'], axis=1, inplace=True)

In [162]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_10_df['latitude'] = JNorth_Larva_First_Site_2002_10_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_10_df['longitude'] = JNorth_Larva_First_Site_2002_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [163]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_10_df, cols)

In [164]:
file = open("JNorth_Larva_First_Site_2002_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [165]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_11_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==11]
JNorth_Larva_First_Site_2002_11_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [166]:
JNorth_Larva_First_Site_2002_11_df.shape

(0, 6)

In [167]:
JNorth_Larva_First_Site_2002_11_df = pd.DataFrame(JNorth_Larva_First_Site_2002_11_df)
JNorth_Larva_First_Site_2002_11_df.drop(['month'], axis=1, inplace=True)

In [168]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_11_df['latitude'] = JNorth_Larva_First_Site_2002_11_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_11_df['longitude'] = JNorth_Larva_First_Site_2002_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [169]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_11_df, cols)

In [170]:
file = open("JNorth_Larva_First_Site_2002_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [171]:
JNorth_Larva_First_Site_2002_month_df =pd.DataFrame(JNorth_Larva_First_Site_2002_df)
JNorth_Larva_First_Site_2002_12_df = JNorth_Larva_First_Site_2002_month_df[JNorth_Larva_First_Site_2002_month_df['month']==12]
JNorth_Larva_First_Site_2002_12_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [172]:
JNorth_Larva_First_Site_2002_12_df.shape

(0, 6)

In [173]:
JNorth_Larva_First_Site_2002_12_df = pd.DataFrame(JNorth_Larva_First_Site_2002_12_df)
JNorth_Larva_First_Site_2002_12_df.drop(['month'], axis=1, inplace=True)

In [174]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2002_12_df['latitude'] = JNorth_Larva_First_Site_2002_12_df['latitude'].astype(float)
JNorth_Larva_First_Site_2002_12_df['longitude'] = JNorth_Larva_First_Site_2002_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [175]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2002_12_df, cols)

In [176]:
file = open("JNorth_Larva_First_Site_2002_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2003

In [177]:
JNorth_Larva_First_Site_2003_df = JNorth_Larva_First_Site_year_df[JNorth_Larva_First_Site_year_df['year']==2003]
JNorth_Larva_First_Site_2003_df.tail()

,sighting_date,species,latitude,longitude,number,year
148,2003-06-17,Monarch Larva (FIRST sighted),43.079,-89.377,1,2003
149,2003-06-18,Monarch Larva (FIRST sighted),40.686,-89.595,1,2003
150,2003-06-18,Monarch Larva (FIRST sighted),45.106,-93.460,1,2003
151,2003-06-25,Monarch Larva (FIRST sighted),41.364,-82.135,1,2003
152,2003-07-18,Monarch Larva (FIRST sighted),42.324,-83.341,1,2003

In [178]:
JNorth_Larva_First_Site_2003_df.shape

(43, 6)

In [179]:
JNorth_Larva_First_Site_2003_df = pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_df.drop(['year'], axis=1, inplace=True)

In [180]:
JNorth_Larva_First_Site_2003_df.tail

<bound method NDFrame.tail of     sighting_date                        species  latitude  longitude  number
110    2003-02-11  Monarch Larva (FIRST sighted)    29.757    -95.365       1
111    2003-03-19  Monarch Larva (FIRST sighted)    28.958   -100.392       1
112    2003-03-21  Monarch Larva (FIRST sighted)    27.797    -97.399       1
113    2003-03-23  Monarch Larva (FIRST sighted)    28.810    -96.980       1
114    2003-03-26  Monarch Larva (FIRST sighted)    28.529    -96.679       1
115    2003-03-30  Monarch Larva (FIRST sighted)    29.836    -95.735       1
116    2003-03-31  Monarch Larva (FIRST sighted)    30.315    -90.921       1
117    2003-04-01  Monarch Larva (FIRST sighted)    29.757    -95.365       1
118    2003-04-01  Monarch Larva (FIRST sighted)    31.688    -89.111       1
119    2003-04-03  Monarch Larva (FIRST sighted)    30.540    -96.725       1
120    2003-04-07  Monarch Larva (FIRST sighted)    29.501    -95.192       1
121    2003-04-07  Monarch Larva (FIRST sighted)    32.386    -90.340       1
122    2003-04-08  Monarch Larva (FIRST sighted)    30.388    -87.059       1
123    2003-04-13  Monarch Larva (FIRST sighted)    29.501    -95.192       1
124    2003-04-20  Monarch Larva (FIRST sighted)    35.276    -93.703       1
125    2003-04-21  Monarch Larva (FIRST sighted)    34.253    -85.124       1
126    2003-04-23  Monarch Larva (FIRST sighted)    36.405    -86.452       1
127    2003-05-02  Monarch Larva (FIRST sighted)    35.998    -86.787       1
128    2003-05-03  Monarch Larva (FIRST sighted)    38.594    -89.364       1
129    2003-05-05  Monarch Larva (FIRST sighted)    36.070    -79.766       1
130    2003-05-06  Monarch Larva (FIRST sighted)    37.008    -76.387       1
131    2003-05-10  Monarch Larva (FIRST sighted)    37.301    -86.079       1
132    2003-05-13  Monarch Larva (FIRST sighted)    40.341    -88.863       1
133    2003-05-16  Monarch Larva (FIRST sighted)    32.758    -97.328       1
134    2003-05-18  Monarch Larva (FIRST sighted)    43.231    -79.502       1
135    2003-05-19  Monarch Larva (FIRST sighted)    41.549    -81.472       1
136    2003-05-23  Monarch Larva (FIRST sighted)    30.210    -81.381       1
137    2003-05-28  Monarch Larva (FIRST sighted)    41.420    -92.924       1
138    2003-05-28  Monarch Larva (FIRST sighted)    45.042    -93.485       1
139    2003-05-31  Monarch Larva (FIRST sighted)    40.500    -79.366       1
140    2003-05-31  Monarch Larva (FIRST sighted)    46.121    -96.441       1
141    2003-06-02  Monarch Larva (FIRST sighted)    45.326    -94.947       1
142    2003-06-04  Monarch Larva (FIRST sighted)    35.194    -80.827       1
143    2003-06-05  Monarch Larva (FIRST sighted)    43.038    -87.916       1
144    2003-06-07  Monarch Larva (FIRST sighted)    39.104    -94.601       1
145    2003-06-10  Monarch Larva (FIRST sighted)    33.519    -86.808       1
146    2003-06-10  Monarch Larva (FIRST sighted)    44.480    -93.155       1
147    2003-06-15  Monarch Larva (FIRST sighted)    41.865    -88.063       1
148    2003-06-17  Monarch Larva (FIRST sighted)    43.079    -89.377       1
149    2003-06-18  Monarch Larva (FIRST sighted)    40.686    -89.595       1
150    2003-06-18  Monarch Larva (FIRST sighted)    45.106    -93.460       1
151    2003-06-25  Monarch Larva (FIRST sighted)    41.364    -82.135       1
152    2003-07-18  Monarch Larva (FIRST sighted)    42.324    -83.341       1>

In [181]:
JNorth_Larva_First_Site_2003_df['month'] = pd.DatetimeIndex(JNorth_Larva_First_Site_2003_df['sighting_date']).month

## January

In [182]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_1_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==1]
JNorth_Larva_First_Site_2003_1_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [183]:
JNorth_Larva_First_Site_2003_1_df.shape

(0, 6)

In [184]:
JNorth_Larva_First_Site_2003_1_df = pd.DataFrame(JNorth_Larva_First_Site_2003_1_df)
JNorth_Larva_First_Site_2003_1_df.drop(['month'], axis=1, inplace=True)

In [185]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_1_df['latitude'] = JNorth_Larva_First_Site_2003_1_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_1_df['longitude'] = JNorth_Larva_First_Site_2003_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [186]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_1_df, cols)

In [187]:
file = open("JNorth_Larva_First_Site_2003_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [188]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_2_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==2]
JNorth_Larva_First_Site_2003_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
110,2003-02-11,Monarch Larva (FIRST sighted),29.757,-95.365,1,2

In [189]:
JNorth_Larva_First_Site_2003_2_df.shape

(1, 6)

In [190]:
JNorth_Larva_First_Site_2003_2_df = pd.DataFrame(JNorth_Larva_First_Site_2003_2_df)
JNorth_Larva_First_Site_2003_2_df.drop(['month'], axis=1, inplace=True)

In [191]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_2_df['latitude'] = JNorth_Larva_First_Site_2003_2_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_2_df['longitude'] = JNorth_Larva_First_Site_2003_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [192]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_2_df, cols)

In [193]:
file = open("JNorth_Larva_First_Site_2003_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [194]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_3_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==3]
JNorth_Larva_First_Site_2003_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
112,2003-03-21,Monarch Larva (FIRST sighted),27.797,-97.399,1,3
113,2003-03-23,Monarch Larva (FIRST sighted),28.810,-96.980,1,3
114,2003-03-26,Monarch Larva (FIRST sighted),28.529,-96.679,1,3
115,2003-03-30,Monarch Larva (FIRST sighted),29.836,-95.735,1,3
116,2003-03-31,Monarch Larva (FIRST sighted),30.315,-90.921,1,3

In [195]:
JNorth_Larva_First_Site_2003_3_df.shape

(6, 6)

In [196]:
JNorth_Larva_First_Site_2003_3_df = pd.DataFrame(JNorth_Larva_First_Site_2003_3_df)
JNorth_Larva_First_Site_2003_3_df.drop(['month'], axis=1, inplace=True)

In [197]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_3_df['latitude'] = JNorth_Larva_First_Site_2003_3_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_3_df['longitude'] = JNorth_Larva_First_Site_2003_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [198]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_3_df, cols)

In [199]:
file = open("JNorth_Larva_First_Site_2003_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [200]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_4_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==4]
JNorth_Larva_First_Site_2003_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
122,2003-04-08,Monarch Larva (FIRST sighted),30.388,-87.059,1,4
123,2003-04-13,Monarch Larva (FIRST sighted),29.501,-95.192,1,4
124,2003-04-20,Monarch Larva (FIRST sighted),35.276,-93.703,1,4
125,2003-04-21,Monarch Larva (FIRST sighted),34.253,-85.124,1,4
126,2003-04-23,Monarch Larva (FIRST sighted),36.405,-86.452,1,4

In [201]:
JNorth_Larva_First_Site_2003_4_df.shape

(10, 6)

In [202]:
JNorth_Larva_First_Site_2003_4_df =pd.DataFrame(JNorth_Larva_First_Site_2003_4_df)
JNorth_Larva_First_Site_2003_4_df.drop(['month'], axis=1, inplace=True)

In [203]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_4_df['latitude'] = JNorth_Larva_First_Site_2003_4_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_4_df['longitude'] = JNorth_Larva_First_Site_2003_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [204]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_4_df, cols)

In [205]:
file = open("JNorth_Larva_First_Site_2003_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [206]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_5_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==5]
JNorth_Larva_First_Site_2003_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
136,2003-05-23,Monarch Larva (FIRST sighted),30.210,-81.381,1,5
137,2003-05-28,Monarch Larva (FIRST sighted),41.420,-92.924,1,5
138,2003-05-28,Monarch Larva (FIRST sighted),45.042,-93.485,1,5
139,2003-05-31,Monarch Larva (FIRST sighted),40.500,-79.366,1,5
140,2003-05-31,Monarch Larva (FIRST sighted),46.121,-96.441,1,5

In [207]:
JNorth_Larva_First_Site_2003_5_df.shape

(14, 6)

In [208]:
JNorth_Larva_First_Site_2003_5_df =pd.DataFrame(JNorth_Larva_First_Site_2003_5_df)
JNorth_Larva_First_Site_2003_5_df.drop(['month'], axis=1, inplace=True)

In [209]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_5_df['latitude'] = JNorth_Larva_First_Site_2003_5_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_5_df['longitude'] = JNorth_Larva_First_Site_2003_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [210]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_5_df, cols)

In [211]:
file = open("JNorth_Larva_First_Site_2003_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [212]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_6_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==6]
JNorth_Larva_First_Site_2003_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
147,2003-06-15,Monarch Larva (FIRST sighted),41.865,-88.063,1,6
148,2003-06-17,Monarch Larva (FIRST sighted),43.079,-89.377,1,6
149,2003-06-18,Monarch Larva (FIRST sighted),40.686,-89.595,1,6
150,2003-06-18,Monarch Larva (FIRST sighted),45.106,-93.460,1,6
151,2003-06-25,Monarch Larva (FIRST sighted),41.364,-82.135,1,6

In [213]:
JNorth_Larva_First_Site_2003_6_df.shape

(11, 6)

In [214]:
JNorth_Larva_First_Site_2003_6_df = pd.DataFrame(JNorth_Larva_First_Site_2003_6_df)
JNorth_Larva_First_Site_2003_6_df.drop(['month'], axis=1, inplace=True)

In [215]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_6_df['latitude'] = JNorth_Larva_First_Site_2003_6_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_6_df['longitude'] = JNorth_Larva_First_Site_2003_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [216]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_6_df, cols)

In [217]:
file = open("JNorth_Larva_First_Site_2003_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [218]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_7_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==7]
JNorth_Larva_First_Site_2003_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
152,2003-07-18,Monarch Larva (FIRST sighted),42.324,-83.341,1,7

In [219]:
JNorth_Larva_First_Site_2003_7_df.shape

(1, 6)

In [220]:
JNorth_Larva_First_Site_2003_7_df = pd.DataFrame(JNorth_Larva_First_Site_2003_7_df)
JNorth_Larva_First_Site_2003_7_df.drop(['month'], axis=1, inplace=True)

In [221]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_7_df['latitude'] = JNorth_Larva_First_Site_2003_7_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_7_df['longitude'] = JNorth_Larva_First_Site_2003_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [222]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_7_df, cols)

In [223]:
file = open("JNorth_Larva_First_Site_2003_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [224]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_8_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==8]
JNorth_Larva_First_Site_2003_8_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [225]:
JNorth_Larva_First_Site_2003_8_df.shape

(0, 6)

In [226]:
JNorth_Larva_First_Site_2003_8_df = pd.DataFrame(JNorth_Larva_First_Site_2003_8_df)
JNorth_Larva_First_Site_2003_8_df.drop(['month'], axis=1, inplace=True)

In [227]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_8_df['latitude'] = JNorth_Larva_First_Site_2003_8_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_8_df['longitude'] = JNorth_Larva_First_Site_2003_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [228]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_8_df, cols)

In [229]:
file = open("JNorth_Larva_First_Site_2003_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [230]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_9_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==9]
JNorth_Larva_First_Site_2003_9_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [231]:
JNorth_Larva_First_Site_2003_9_df.shape

(0, 6)

In [232]:
JNorth_Larva_First_Site_2003_9_df = pd.DataFrame(JNorth_Larva_First_Site_2003_9_df)
JNorth_Larva_First_Site_2003_9_df.drop(['month'], axis=1, inplace=True)

In [233]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_9_df['latitude'] = JNorth_Larva_First_Site_2003_9_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_9_df['longitude'] = JNorth_Larva_First_Site_2003_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [234]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_9_df, cols)

In [235]:
file = open("JNorth_Larva_First_Site_2003_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [236]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_10_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==10]
JNorth_Larva_First_Site_2003_10_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [237]:
JNorth_Larva_First_Site_2003_10_df.shape

(0, 6)

In [238]:
JNorth_Larva_First_Site_2003_10_df = pd.DataFrame(JNorth_Larva_First_Site_2003_10_df)
JNorth_Larva_First_Site_2003_10_df.drop(['month'], axis=1, inplace=True)

In [239]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_10_df['latitude'] = JNorth_Larva_First_Site_2003_10_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_10_df['longitude'] = JNorth_Larva_First_Site_2003_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [240]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_10_df, cols)

In [241]:
file = open("JNorth_Larva_First_Site_2003_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [242]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_11_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==11]
JNorth_Larva_First_Site_2003_11_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [243]:
JNorth_Larva_First_Site_2003_11_df.shape

(0, 6)

In [244]:
JNorth_Larva_First_Site_2003_11_df = pd.DataFrame(JNorth_Larva_First_Site_2003_11_df)
JNorth_Larva_First_Site_2003_11_df.drop(['month'], axis=1, inplace=True)

In [245]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_11_df['latitude'] = JNorth_Larva_First_Site_2003_11_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_11_df['longitude'] = JNorth_Larva_First_Site_2003_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [246]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_11_df, cols)

In [247]:
file = open("JNorth_Larva_First_Site_2003_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [248]:
JNorth_Larva_First_Site_2003_month_df =pd.DataFrame(JNorth_Larva_First_Site_2003_df)
JNorth_Larva_First_Site_2003_12_df = JNorth_Larva_First_Site_2003_month_df[JNorth_Larva_First_Site_2003_month_df['month']==12]
JNorth_Larva_First_Site_2003_12_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [249]:
JNorth_Larva_First_Site_2003_12_df.shape

(0, 6)

In [250]:
JNorth_Larva_First_Site_2003_12_df = pd.DataFrame(JNorth_Larva_First_Site_2003_12_df)
JNorth_Larva_First_Site_2003_12_df.drop(['month'], axis=1, inplace=True)

In [251]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2003_12_df['latitude'] = JNorth_Larva_First_Site_2003_12_df['latitude'].astype(float)
JNorth_Larva_First_Site_2003_12_df['longitude'] = JNorth_Larva_First_Site_2003_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [252]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2003_12_df, cols)

In [253]:
file = open("JNorth_Larva_First_Site_2003_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2004

In [254]:
JNorth_Larva_First_Site_2004_df = JNorth_Larva_First_Site_year_df[JNorth_Larva_First_Site_year_df['year']==2004]
JNorth_Larva_First_Site_2004_df.tail()

,sighting_date,species,latitude,longitude,number,year
207,2004-07-13,Monarch Larva (FIRST sighted),29.757,-95.365,1,2004
208,2004-07-14,Monarch Larva (FIRST sighted),36.739,-76.231,1,2004
209,2004-07-14,Monarch Larva (FIRST sighted),39.533,-76.353,1,2004
210,2004-07-15,Monarch Larva (FIRST sighted),42.189,-74.923,1,2004
211,2004-08-18,Monarch Larva (FIRST sighted),39.068,-78.195,1,2004

In [255]:
JNorth_Larva_First_Site_2004_df.shape

(59, 6)

In [256]:
JNorth_Larva_First_Site_2004_df = pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_df.drop(['year'], axis=1, inplace=True)

In [257]:
JNorth_Larva_First_Site_2004_df.tail

<bound method NDFrame.tail of     sighting_date                        species  latitude  longitude  number
153    2004-01-25  Monarch Larva (FIRST sighted)    29.757    -95.365       1
154    2004-02-13  Monarch Larva (FIRST sighted)    28.711    -81.347       1
155    2004-02-16  Monarch Larva (FIRST sighted)    26.044    -80.364       1
156    2004-02-28  Monarch Larva (FIRST sighted)    29.757    -95.365       1
157    2004-03-03  Monarch Larva (FIRST sighted)    29.757    -95.365       1
158    2004-03-11  Monarch Larva (FIRST sighted)    28.210    -82.289       1
159    2004-03-12  Monarch Larva (FIRST sighted)    28.029    -80.608       1
160    2004-03-14  Monarch Larva (FIRST sighted)    28.233    -97.019       1
161    2004-03-14  Monarch Larva (FIRST sighted)    29.957    -90.078       1
162    2004-03-15  Monarch Larva (FIRST sighted)    28.233    -97.019       1
163    2004-03-20  Monarch Larva (FIRST sighted)    29.367    -95.088       1
164    2004-03-21  Monarch Larva (FIRST sighted)    30.429    -84.258       1
165    2004-03-26  Monarch Larva (FIRST sighted)    29.757    -95.365       1
166    2004-03-27  Monarch Larva (FIRST sighted)    26.264    -97.458       1
167    2004-03-29  Monarch Larva (FIRST sighted)    29.548    -95.034       1
168    2004-03-30  Monarch Larva (FIRST sighted)    27.797    -97.399       1
169    2004-04-01  Monarch Larva (FIRST sighted)    30.047    -95.214       1
170    2004-04-05  Monarch Larva (FIRST sighted)    29.757    -95.365       1
171    2004-04-07  Monarch Larva (FIRST sighted)    29.560    -95.278       1
172    2004-04-08  Monarch Larva (FIRST sighted)    29.164    -95.482       1
173    2004-04-10  Monarch Larva (FIRST sighted)    29.634    -98.742       1
174    2004-04-11  Monarch Larva (FIRST sighted)    27.770    -82.637       1
175    2004-04-11  Monarch Larva (FIRST sighted)    29.309    -94.782       1
176    2004-04-14  Monarch Larva (FIRST sighted)    29.545    -81.224       1
177    2004-04-14  Monarch Larva (FIRST sighted)    31.616    -98.994       1
178    2004-04-15  Monarch Larva (FIRST sighted)    29.959    -90.218       1
179    2004-04-17  Monarch Larva (FIRST sighted)    30.230    -97.714       1
180    2004-04-18  Monarch Larva (FIRST sighted)    29.469    -98.528       1
181    2004-04-18  Monarch Larva (FIRST sighted)    32.420    -97.090       1
182    2004-04-19  Monarch Larva (FIRST sighted)    29.676    -98.570       1
183    2004-04-19  Monarch Larva (FIRST sighted)    29.821    -98.751       1
184    2004-04-26  Monarch Larva (FIRST sighted)    30.201    -90.932       1
185    2004-05-07  Monarch Larva (FIRST sighted)    30.230    -97.714       1
186    2004-05-13  Monarch Larva (FIRST sighted)    42.012    -87.844       1
187    2004-05-14  Monarch Larva (FIRST sighted)    36.405    -86.452       1
188    2004-05-15  Monarch Larva (FIRST sighted)    39.391    -77.381       1
189    2004-05-15  Monarch Larva (FIRST sighted)    41.332    -85.021       1
190    2004-05-25  Monarch Larva (FIRST sighted)    40.817    -96.710       1
191    2004-05-27  Monarch Larva (FIRST sighted)    36.005    -93.218       1
192    2004-06-05  Monarch Larva (FIRST sighted)    36.079    -79.827       1
193    2004-06-07  Monarch Larva (FIRST sighted)    45.965    -93.287       1
194    2004-06-14  Monarch Larva (FIRST sighted)    44.738    -91.510       1
195    2004-06-17  Monarch Larva (FIRST sighted)    44.966    -93.084       1
196    2004-06-18  Monarch Larva (FIRST sighted)    43.052    -71.191       1
197    2004-06-19  Monarch Larva (FIRST sighted)    42.055    -93.569       1
198    2004-06-22  Monarch Larva (FIRST sighted)    42.356    -72.570       1
199    2004-06-24  Monarch Larva (FIRST sighted)    38.415    -95.259       1
200    2004-06-24  Monarch Larva (FIRST sighted)    38.799   -121.929       1
201    2004-06-24  Monarch Larva (FIRST sighted)    46.959    -88.605       1
202    2004-06-27  Monarch Larva (FIRST sighted)    39.358    -87.407       1
203    2004-06-30  Monarch Larva (FIRST sighted)    44.632   -123.284       1
204    2004-07-01  Monarch Larva (FIRST sighted)    36.739    -76.231       1
205    2004-07-02  Monarch Larva (FIRST sighted)    43.079    -89.377       1
206    2004-07-11  Monarch Larva (FIRST sighted)    45.617   -123.247       1
207    2004-07-13  Monarch Larva (FIRST sighted)    29.757    -95.365       1
208    2004-07-14  Monarch Larva (FIRST sighted)    36.739    -76.231       1
209    2004-07-14  Monarch Larva (FIRST sighted)    39.533    -76.353       1
210    2004-07-15  Monarch Larva (FIRST sighted)    42.189    -74.923       1
211    2004-08-18  Monarch Larva (FIRST sighted)    39.068    -78.195       1>

In [258]:
JNorth_Larva_First_Site_2004_df['month'] = pd.DatetimeIndex(JNorth_Larva_First_Site_2004_df['sighting_date']).month

## January

In [259]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_1_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==1]
JNorth_Larva_First_Site_2004_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
153,2004-01-25,Monarch Larva (FIRST sighted),29.757,-95.365,1,1

In [260]:
JNorth_Larva_First_Site_2004_1_df.shape

(1, 6)

In [261]:
JNorth_Larva_First_Site_2004_1_df = pd.DataFrame(JNorth_Larva_First_Site_2004_1_df)
JNorth_Larva_First_Site_2004_1_df.drop(['month'], axis=1, inplace=True)

In [262]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_1_df['latitude'] = JNorth_Larva_First_Site_2004_1_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_1_df['longitude'] = JNorth_Larva_First_Site_2004_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [263]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_1_df, cols)

In [264]:
file = open("JNorth_Larva_First_Site_2004_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [265]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_2_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==2]
JNorth_Larva_First_Site_2004_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
154,2004-02-13,Monarch Larva (FIRST sighted),28.711,-81.347,1,2
155,2004-02-16,Monarch Larva (FIRST sighted),26.044,-80.364,1,2
156,2004-02-28,Monarch Larva (FIRST sighted),29.757,-95.365,1,2

In [266]:
JNorth_Larva_First_Site_2004_2_df.shape

(3, 6)

In [267]:
JNorth_Larva_First_Site_2004_2_df = pd.DataFrame(JNorth_Larva_First_Site_2004_2_df)
JNorth_Larva_First_Site_2004_2_df.drop(['month'], axis=1, inplace=True)

In [268]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_2_df['latitude'] = JNorth_Larva_First_Site_2004_2_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_2_df['longitude'] = JNorth_Larva_First_Site_2004_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [269]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_2_df, cols)

In [270]:
file = open("JNorth_Larva_First_Site_2004_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [271]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_3_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==3]
JNorth_Larva_First_Site_2004_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
164,2004-03-21,Monarch Larva (FIRST sighted),30.429,-84.258,1,3
165,2004-03-26,Monarch Larva (FIRST sighted),29.757,-95.365,1,3
166,2004-03-27,Monarch Larva (FIRST sighted),26.264,-97.458,1,3
167,2004-03-29,Monarch Larva (FIRST sighted),29.548,-95.034,1,3
168,2004-03-30,Monarch Larva (FIRST sighted),27.797,-97.399,1,3

In [272]:
JNorth_Larva_First_Site_2004_3_df.shape

(12, 6)

In [273]:
JNorth_Larva_First_Site_2004_3_df = pd.DataFrame(JNorth_Larva_First_Site_2004_3_df)
JNorth_Larva_First_Site_2004_3_df.drop(['month'], axis=1, inplace=True)

In [274]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_3_df['latitude'] = JNorth_Larva_First_Site_2004_3_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_3_df['longitude'] = JNorth_Larva_First_Site_2004_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [275]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_3_df, cols)

In [276]:
file = open("JNorth_Larva_First_Site_2004_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [277]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_4_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==4]
JNorth_Larva_First_Site_2004_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
180,2004-04-18,Monarch Larva (FIRST sighted),29.469,-98.528,1,4
181,2004-04-18,Monarch Larva (FIRST sighted),32.420,-97.090,1,4
182,2004-04-19,Monarch Larva (FIRST sighted),29.676,-98.570,1,4
183,2004-04-19,Monarch Larva (FIRST sighted),29.821,-98.751,1,4
184,2004-04-26,Monarch Larva (FIRST sighted),30.201,-90.932,1,4

In [278]:
JNorth_Larva_First_Site_2004_4_df.shape

(16, 6)

In [279]:
JNorth_Larva_First_Site_2004_4_df = pd.DataFrame(JNorth_Larva_First_Site_2004_4_df)
JNorth_Larva_First_Site_2004_4_df.drop(['month'], axis=1, inplace=True)

In [280]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_4_df['latitude'] = JNorth_Larva_First_Site_2004_4_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_4_df['longitude'] = JNorth_Larva_First_Site_2004_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [281]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_4_df, cols)

In [282]:
file = open("JNorth_Larva_First_Site_2004_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [283]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_5_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==5]
JNorth_Larva_First_Site_2004_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
187,2004-05-14,Monarch Larva (FIRST sighted),36.405,-86.452,1,5
188,2004-05-15,Monarch Larva (FIRST sighted),39.391,-77.381,1,5
189,2004-05-15,Monarch Larva (FIRST sighted),41.332,-85.021,1,5
190,2004-05-25,Monarch Larva (FIRST sighted),40.817,-96.710,1,5
191,2004-05-27,Monarch Larva (FIRST sighted),36.005,-93.218,1,5

In [284]:
JNorth_Larva_First_Site_2004_5_df.shape

(7, 6)

In [285]:
JNorth_Larva_First_Site_2004_5_df = pd.DataFrame(JNorth_Larva_First_Site_2004_5_df)
JNorth_Larva_First_Site_2004_5_df.drop(['month'], axis=1, inplace=True)

In [286]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_5_df['latitude'] = JNorth_Larva_First_Site_2004_5_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_5_df['longitude'] = JNorth_Larva_First_Site_2004_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [287]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_5_df, cols)

In [288]:
file = open("JNorth_Larva_First_Site_2004_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [289]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_6_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==6]
JNorth_Larva_First_Site_2004_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
199,2004-06-24,Monarch Larva (FIRST sighted),38.415,-95.259,1,6
200,2004-06-24,Monarch Larva (FIRST sighted),38.799,-121.929,1,6
201,2004-06-24,Monarch Larva (FIRST sighted),46.959,-88.605,1,6
202,2004-06-27,Monarch Larva (FIRST sighted),39.358,-87.407,1,6
203,2004-06-30,Monarch Larva (FIRST sighted),44.632,-123.284,1,6

In [290]:
JNorth_Larva_First_Site_2004_6_df.shape

(12, 6)

In [291]:
JNorth_Larva_First_Site_2004_6_df = pd.DataFrame(JNorth_Larva_First_Site_2004_6_df)
JNorth_Larva_First_Site_2004_6_df.drop(['month'], axis=1, inplace=True)

In [292]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_6_df['latitude'] = JNorth_Larva_First_Site_2004_6_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_6_df['longitude'] = JNorth_Larva_First_Site_2004_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [293]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_6_df, cols)

In [294]:
file = open("JNorth_Larva_First_Site_2004_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [295]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_7_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==7]
JNorth_Larva_First_Site_2004_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
206,2004-07-11,Monarch Larva (FIRST sighted),45.617,-123.247,1,7
207,2004-07-13,Monarch Larva (FIRST sighted),29.757,-95.365,1,7
208,2004-07-14,Monarch Larva (FIRST sighted),36.739,-76.231,1,7
209,2004-07-14,Monarch Larva (FIRST sighted),39.533,-76.353,1,7
210,2004-07-15,Monarch Larva (FIRST sighted),42.189,-74.923,1,7

In [296]:
JNorth_Larva_First_Site_2004_7_df.shape

(7, 6)

In [297]:
JNorth_Larva_First_Site_2004_7_df = pd.DataFrame(JNorth_Larva_First_Site_2004_7_df)
JNorth_Larva_First_Site_2004_7_df.drop(['month'], axis=1, inplace=True)

In [298]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_7_df['latitude'] = JNorth_Larva_First_Site_2004_7_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_7_df['longitude'] = JNorth_Larva_First_Site_2004_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [299]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_7_df, cols)

In [300]:
file = open("JNorth_Larva_First_Site_2004_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [301]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_8_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==8]
JNorth_Larva_First_Site_2004_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
211,2004-08-18,Monarch Larva (FIRST sighted),39.068,-78.195,1,8

In [302]:
JNorth_Larva_First_Site_2004_8_df.shape

(1, 6)

In [303]:
JNorth_Larva_First_Site_2004_8_df= pd.DataFrame(JNorth_Larva_First_Site_2004_8_df)
JNorth_Larva_First_Site_2004_8_df.drop(['month'], axis=1, inplace=True)

In [304]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_8_df['latitude'] = JNorth_Larva_First_Site_2004_8_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_8_df['longitude'] = JNorth_Larva_First_Site_2004_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [305]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_8_df, cols)

In [306]:
file = open("JNorth_Larva_First_Site_2004_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [307]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_9_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==9]
JNorth_Larva_First_Site_2004_9_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [308]:
JNorth_Larva_First_Site_2004_9_df.shape

(0, 6)

In [309]:
JNorth_Larva_First_Site_2004_9_df = pd.DataFrame(JNorth_Larva_First_Site_2004_9_df)
JNorth_Larva_First_Site_2004_9_df.drop(['month'], axis=1, inplace=True)

In [310]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_9_df['latitude'] = JNorth_Larva_First_Site_2004_9_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_9_df['longitude'] = JNorth_Larva_First_Site_2004_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [311]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_9_df, cols)

In [312]:
file = open("JNorth_Larva_First_Site_2004_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [313]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_10_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==10]
JNorth_Larva_First_Site_2004_10_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [314]:
JNorth_Larva_First_Site_2004_10_df.shape

(0, 6)

In [315]:
JNorth_Larva_First_Site_2004_10_df = pd.DataFrame(JNorth_Larva_First_Site_2004_10_df)
JNorth_Larva_First_Site_2004_10_df.drop(['month'], axis=1, inplace=True)

In [316]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_10_df['latitude'] = JNorth_Larva_First_Site_2004_10_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_10_df['longitude'] = JNorth_Larva_First_Site_2004_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [317]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_10_df, cols)

In [318]:
file = open("JNorth_Larva_First_Site_2004_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [319]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_11_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==11]
JNorth_Larva_First_Site_2004_11_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [320]:
JNorth_Larva_First_Site_2004_11_df.shape

(0, 6)

In [321]:
JNorth_Larva_First_Site_2004_11_df = pd.DataFrame(JNorth_Larva_First_Site_2004_11_df)
JNorth_Larva_First_Site_2004_11_df.drop(['month'], axis=1, inplace=True)

In [322]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_11_df['latitude'] = JNorth_Larva_First_Site_2004_11_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_11_df['longitude'] = JNorth_Larva_First_Site_2004_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [323]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_11_df, cols)

In [324]:
file = open("JNorth_Larva_First_Site_2004_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [325]:
JNorth_Larva_First_Site_2004_month_df =pd.DataFrame(JNorth_Larva_First_Site_2004_df)
JNorth_Larva_First_Site_2004_12_df = JNorth_Larva_First_Site_2004_month_df[JNorth_Larva_First_Site_2004_month_df['month']==12]
JNorth_Larva_First_Site_2004_12_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [326]:
JNorth_Larva_First_Site_2004_12_df.shape

(0, 6)

In [327]:
JNorth_Larva_First_Site_2004_12_df = pd.DataFrame(JNorth_Larva_First_Site_2004_12_df)
JNorth_Larva_First_Site_2004_12_df.drop(['month'], axis=1, inplace=True)

In [328]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2004_12_df['latitude'] = JNorth_Larva_First_Site_2004_12_df['latitude'].astype(float)
JNorth_Larva_First_Site_2004_12_df['longitude'] = JNorth_Larva_First_Site_2004_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [329]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2004_12_df, cols)

In [330]:
file = open("JNorth_Larva_First_Site_2004_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2005

In [331]:
JNorth_Larva_First_Site_2005_df = JNorth_Larva_First_Site_df[JNorth_Larva_First_Site_df['year']==2005]
JNorth_Larva_First_Site_2005_df.tail()

,sighting_date,species,latitude,longitude,number,year
266,2005-07-17,Monarch Larva (FIRST sighted),46.340,-71.260,1,2005
267,2005-07-23,Monarch Larva (FIRST sighted),40.570,-74.739,1,2005
268,2005-07-24,Monarch Larva (FIRST sighted),39.068,-78.195,1,2005
269,2005-07-27,Monarch Larva (FIRST sighted),39.213,-81.858,1,2005
270,2005-07-31,Monarch Larva (FIRST sighted),37.538,-77.436,1,2005

In [332]:
JNorth_Larva_First_Site_2005_df.shape

(59, 6)

In [333]:
JNorth_Larva_First_Site_2005_df = pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_df.drop(['year'], axis=1, inplace=True)

In [334]:
JNorth_Larva_First_Site_2005_df.tail

<bound method NDFrame.tail of     sighting_date                        species  latitude  longitude  number
212    2005-01-15  Monarch Larva (FIRST sighted)    27.770    -82.637       1
213    2005-01-15  Monarch Larva (FIRST sighted)    27.980    -82.781       1
214    2005-02-19  Monarch Larva (FIRST sighted)    27.792    -80.479       1
215    2005-02-20  Monarch Larva (FIRST sighted)    34.346   -119.329       1
216    2005-02-21  Monarch Larva (FIRST sighted)    29.757    -95.365       1
217    2005-02-26  Monarch Larva (FIRST sighted)    29.757    -95.365       1
218    2005-03-05  Monarch Larva (FIRST sighted)    28.080    -80.672       1
219    2005-03-05  Monarch Larva (FIRST sighted)    29.757    -95.365       1
220    2005-03-10  Monarch Larva (FIRST sighted)    29.769    -95.387       1
221    2005-03-13  Monarch Larva (FIRST sighted)    33.683   -118.012       1
222    2005-03-17  Monarch Larva (FIRST sighted)    26.058    -80.338       1
223    2005-03-19  Monarch Larva (FIRST sighted)    29.757    -95.365       1
224    2005-03-31  Monarch Larva (FIRST sighted)    29.757    -95.365       1
225    2005-04-06  Monarch Larva (FIRST sighted)    44.804    -93.167       1
226    2005-04-07  Monarch Larva (FIRST sighted)    28.228    -96.644       1
227    2005-04-08  Monarch Larva (FIRST sighted)    33.580    -91.792       1
228    2005-04-10  Monarch Larva (FIRST sighted)    32.386    -90.340       1
229    2005-04-10  Monarch Larva (FIRST sighted)    33.821    -93.339       1
230    2005-04-13  Monarch Larva (FIRST sighted)    30.047    -95.214       1
231    2005-04-13  Monarch Larva (FIRST sighted)    30.315    -90.921       1
232    2005-04-15  Monarch Larva (FIRST sighted)    30.230    -97.714       1
233    2005-04-26  Monarch Larva (FIRST sighted)    36.405    -86.452       1
234    2005-05-12  Monarch Larva (FIRST sighted)    34.346   -119.329       1
235    2005-05-22  Monarch Larva (FIRST sighted)    32.894    -97.148       1
236    2005-05-28  Monarch Larva (FIRST sighted)    44.279    -88.397       1
237    2005-06-02  Monarch Larva (FIRST sighted)    42.442    -83.654       1
238    2005-06-07  Monarch Larva (FIRST sighted)    37.058    -76.464       1
239    2005-06-07  Monarch Larva (FIRST sighted)    40.167    -84.264       1
240    2005-06-07  Monarch Larva (FIRST sighted)    40.594    -74.624       2
241    2005-06-08  Monarch Larva (FIRST sighted)    42.320    -84.391       1
242    2005-06-08  Monarch Larva (FIRST sighted)    42.580    -86.108       1
243    2005-06-09  Monarch Larva (FIRST sighted)    38.415    -95.259       1
244    2005-06-10  Monarch Larva (FIRST sighted)    43.079    -89.377       1
245    2005-06-10  Monarch Larva (FIRST sighted)    44.990    -93.359       1
246    2005-06-14  Monarch Larva (FIRST sighted)    26.717    -80.067       1
247    2005-06-15  Monarch Larva (FIRST sighted)    45.056    -92.961       1
248    2005-06-15  Monarch Larva (FIRST sighted)    45.701    -95.023       1
249    2005-06-16  Monarch Larva (FIRST sighted)    42.310    -85.228       1
250    2005-06-16  Monarch Larva (FIRST sighted)    45.701    -95.023       1
251    2005-06-19  Monarch Larva (FIRST sighted)    42.883    -88.126       1
252    2005-06-20  Monarch Larva (FIRST sighted)    40.287    -81.890       1
253    2005-06-21  Monarch Larva (FIRST sighted)    39.581    -75.638       1
254    2005-06-21  Monarch Larva (FIRST sighted)    40.900    -81.431       1
255    2005-06-23  Monarch Larva (FIRST sighted)    43.935    -96.829       1
256    2005-06-25  Monarch Larva (FIRST sighted)    43.060    -94.236       1
257    2005-06-25  Monarch Larva (FIRST sighted)    46.959    -88.605       1
258    2005-06-26  Monarch Larva (FIRST sighted)    49.530    -97.085       1
259    2005-06-26  Monarch Larva (FIRST sighted)    50.084    -96.530       1
260    2005-06-27  Monarch Larva (FIRST sighted)    42.461    -87.874       1
261    2005-06-30  Monarch Larva (FIRST sighted)    43.060    -94.236       1
262    2005-07-01  Monarch Larva (FIRST sighted)    46.849   -100.717       2
263    2005-07-05  Monarch Larva (FIRST sighted)    44.530    -73.060       1
264    2005-07-10  Monarch Larva (FIRST sighted)    43.414    -76.074       1
265    2005-07-11  Monarch Larva (FIRST sighted)    46.160    -79.180       1
266    2005-07-17  Monarch Larva (FIRST sighted)    46.340    -71.260       1
267    2005-07-23  Monarch Larva (FIRST sighted)    40.570    -74.739       1
268    2005-07-24  Monarch Larva (FIRST sighted)    39.068    -78.195       1
269    2005-07-27  Monarch Larva (FIRST sighted)    39.213    -81.858       1
270    2005-07-31  Monarch Larva (FIRST sighted)    37.538    -77.436       1>

In [335]:
JNorth_Larva_First_Site_2005_df['month'] = pd.DatetimeIndex(JNorth_Larva_First_Site_2005_df['sighting_date']).month

## January

In [336]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_1_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==1]
JNorth_Larva_First_Site_2005_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
212,2005-01-15,Monarch Larva (FIRST sighted),27.77,-82.637,1,1
213,2005-01-15,Monarch Larva (FIRST sighted),27.98,-82.781,1,1

In [337]:
JNorth_Larva_First_Site_2005_1_df.shape

(2, 6)

In [338]:
JNorth_Larva_First_Site_2005_1_df = pd.DataFrame(JNorth_Larva_First_Site_2005_1_df)
JNorth_Larva_First_Site_2005_1_df.drop(['month'], axis=1, inplace=True)

In [339]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_1_df['latitude'] = JNorth_Larva_First_Site_2005_1_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_1_df['longitude'] = JNorth_Larva_First_Site_2005_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [340]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_1_df, cols)

In [341]:
file = open("JNorth_Larva_First_Site_2005_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# February

In [342]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_2_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==2]
JNorth_Larva_First_Site_2005_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
214,2005-02-19,Monarch Larva (FIRST sighted),27.792,-80.479,1,2
215,2005-02-20,Monarch Larva (FIRST sighted),34.346,-119.329,1,2
216,2005-02-21,Monarch Larva (FIRST sighted),29.757,-95.365,1,2
217,2005-02-26,Monarch Larva (FIRST sighted),29.757,-95.365,1,2

In [343]:
JNorth_Larva_First_Site_2005_2_df.shape

(4, 6)

In [344]:
JNorth_Larva_First_Site_2005_2_df = pd.DataFrame(JNorth_Larva_First_Site_2005_2_df)
JNorth_Larva_First_Site_2005_2_df.drop(['month'], axis=1, inplace=True)

In [345]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_2_df['latitude'] = JNorth_Larva_First_Site_2005_2_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_2_df['longitude'] = JNorth_Larva_First_Site_2005_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [346]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_2_df, cols)

In [347]:
file = open("JNorth_Larva_First_Site_2005_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# March

In [348]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_3_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==3]
JNorth_Larva_First_Site_2005_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
220,2005-03-10,Monarch Larva (FIRST sighted),29.769,-95.387,1,3
221,2005-03-13,Monarch Larva (FIRST sighted),33.683,-118.012,1,3
222,2005-03-17,Monarch Larva (FIRST sighted),26.058,-80.338,1,3
223,2005-03-19,Monarch Larva (FIRST sighted),29.757,-95.365,1,3
224,2005-03-31,Monarch Larva (FIRST sighted),29.757,-95.365,1,3

In [349]:
JNorth_Larva_First_Site_2005_3_df.shape

(7, 6)

In [350]:
JNorth_Larva_First_Site_2005_3_df = pd.DataFrame(JNorth_Larva_First_Site_2005_3_df)
JNorth_Larva_First_Site_2005_3_df.drop(['month'], axis=1, inplace=True)

In [351]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_3_df['latitude'] = JNorth_Larva_First_Site_2005_3_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_3_df['longitude'] = JNorth_Larva_First_Site_2005_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [352]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_3_df, cols)

In [353]:
file = open("JNorth_Larva_First_Site_2005_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# April

In [354]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_4_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==4]
JNorth_Larva_First_Site_2005_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
229,2005-04-10,Monarch Larva (FIRST sighted),33.821,-93.339,1,4
230,2005-04-13,Monarch Larva (FIRST sighted),30.047,-95.214,1,4
231,2005-04-13,Monarch Larva (FIRST sighted),30.315,-90.921,1,4
232,2005-04-15,Monarch Larva (FIRST sighted),30.230,-97.714,1,4
233,2005-04-26,Monarch Larva (FIRST sighted),36.405,-86.452,1,4

In [355]:
JNorth_Larva_First_Site_2005_4_df.shape

(9, 6)

In [356]:
JNorth_Larva_First_Site_2005_4_df= pd.DataFrame(JNorth_Larva_First_Site_2005_4_df)
JNorth_Larva_First_Site_2005_4_df.drop(['month'], axis=1, inplace=True)

In [357]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_4_df['latitude'] = JNorth_Larva_First_Site_2005_4_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_4_df['longitude'] = JNorth_Larva_First_Site_2005_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [358]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_4_df, cols)

In [359]:
file = open("JNorth_Larva_First_Site_2005_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# May

In [360]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_5_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==5]
JNorth_Larva_First_Site_2005_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
234,2005-05-12,Monarch Larva (FIRST sighted),34.346,-119.329,1,5
235,2005-05-22,Monarch Larva (FIRST sighted),32.894,-97.148,1,5
236,2005-05-28,Monarch Larva (FIRST sighted),44.279,-88.397,1,5

In [361]:
JNorth_Larva_First_Site_2005_5_df.shape

(3, 6)

In [362]:
JNorth_Larva_First_Site_2005_5_df = pd.DataFrame(JNorth_Larva_First_Site_2005_5_df)
JNorth_Larva_First_Site_2005_5_df.drop(['month'], axis=1, inplace=True)

In [363]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_5_df['latitude'] = JNorth_Larva_First_Site_2005_5_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_5_df['longitude'] = JNorth_Larva_First_Site_2005_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [364]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_5_df, cols)

In [365]:
file = open("JNorth_Larva_First_Site_2005_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# June

In [366]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_6_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==6]
JNorth_Larva_First_Site_2005_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
257,2005-06-25,Monarch Larva (FIRST sighted),46.959,-88.605,1,6
258,2005-06-26,Monarch Larva (FIRST sighted),49.530,-97.085,1,6
259,2005-06-26,Monarch Larva (FIRST sighted),50.084,-96.530,1,6
260,2005-06-27,Monarch Larva (FIRST sighted),42.461,-87.874,1,6
261,2005-06-30,Monarch Larva (FIRST sighted),43.060,-94.236,1,6

In [367]:
JNorth_Larva_First_Site_2005_6_df.shape

(25, 6)

In [368]:
JNorth_Larva_First_Site_2005_6_df = pd.DataFrame(JNorth_Larva_First_Site_2005_6_df)
JNorth_Larva_First_Site_2005_6_df.drop(['month'], axis=1, inplace=True)

In [369]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_6_df['latitude'] = JNorth_Larva_First_Site_2005_6_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_6_df['longitude'] = JNorth_Larva_First_Site_2005_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [370]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_6_df, cols)

In [371]:
file = open("JNorth_Larva_First_Site_2005_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# July

In [372]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_7_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==7]
JNorth_Larva_First_Site_2005_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
266,2005-07-17,Monarch Larva (FIRST sighted),46.340,-71.260,1,7
267,2005-07-23,Monarch Larva (FIRST sighted),40.570,-74.739,1,7
268,2005-07-24,Monarch Larva (FIRST sighted),39.068,-78.195,1,7
269,2005-07-27,Monarch Larva (FIRST sighted),39.213,-81.858,1,7
270,2005-07-31,Monarch Larva (FIRST sighted),37.538,-77.436,1,7

In [373]:
JNorth_Larva_First_Site_2005_7_df.shape

(9, 6)

In [374]:
JNorth_Larva_First_Site_2005_7_df = pd.DataFrame(JNorth_Larva_First_Site_2005_7_df)
JNorth_Larva_First_Site_2005_7_df.drop(['month'], axis=1, inplace=True)

In [375]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_7_df['latitude'] = JNorth_Larva_First_Site_2005_7_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_7_df['longitude'] = JNorth_Larva_First_Site_2005_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [376]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_7_df, cols)

In [377]:
file = open("JNorth_Larva_First_Site_2005_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# August

In [378]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_8_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==8]
JNorth_Larva_First_Site_2005_8_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [379]:
JNorth_Larva_First_Site_2005_8_df.shape

(0, 6)

In [380]:
JNorth_Larva_First_Site_2005_8_df = pd.DataFrame(JNorth_Larva_First_Site_2005_8_df)
JNorth_Larva_First_Site_2005_8_df.drop(['month'], axis=1, inplace=True)

In [381]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_8_df['latitude'] = JNorth_Larva_First_Site_2005_8_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_8_df['longitude'] = JNorth_Larva_First_Site_2005_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [382]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_8_df, cols)

In [383]:
file = open("JNorth_Larva_First_Site_2005_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# September

In [384]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_9_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==9]
JNorth_Larva_First_Site_2005_9_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [385]:
JNorth_Larva_First_Site_2005_9_df.shape

(0, 6)

In [386]:
JNorth_Larva_First_Site_2005_9_df = pd.DataFrame(JNorth_Larva_First_Site_2005_9_df)
JNorth_Larva_First_Site_2005_9_df.drop(['month'], axis=1, inplace=True)

In [387]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_9_df['latitude'] = JNorth_Larva_First_Site_2005_9_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_9_df['longitude'] = JNorth_Larva_First_Site_2005_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [388]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_9_df, cols)

In [389]:
file = open("JNorth_Larva_First_Site_2005_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# October

In [390]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_10_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==10]
JNorth_Larva_First_Site_2005_10_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [391]:
JNorth_Larva_First_Site_2005_10_df.shape

(0, 6)

In [392]:
JNorth_Larva_First_Site_2005_10_df = pd.DataFrame(JNorth_Larva_First_Site_2005_10_df)
JNorth_Larva_First_Site_2005_10_df.drop(['month'], axis=1, inplace=True)

In [393]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_10_df['latitude'] = JNorth_Larva_First_Site_2005_10_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_10_df['longitude'] = JNorth_Larva_First_Site_2005_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [394]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_10_df, cols)

In [395]:
file = open("JNorth_Larva_First_Site_2005_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# November

In [396]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_11_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==11]
JNorth_Larva_First_Site_2005_11_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [397]:
JNorth_Larva_First_Site_2005_11_df.shape

(0, 6)

In [398]:
JNorth_Larva_First_Site_2005_11_df = pd.DataFrame(JNorth_Larva_First_Site_2005_11_df)
JNorth_Larva_First_Site_2005_11_df.drop(['month'], axis=1, inplace=True)

In [399]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_11_df['latitude'] = JNorth_Larva_First_Site_2005_11_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_11_df['longitude'] = JNorth_Larva_First_Site_2005_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [400]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_11_df, cols)

In [401]:
file = open("JNorth_Larva_First_Site_2005_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# December

In [402]:
JNorth_Larva_First_Site_2005_month_df =pd.DataFrame(JNorth_Larva_First_Site_2005_df)
JNorth_Larva_First_Site_2005_12_df = JNorth_Larva_First_Site_2005_month_df[JNorth_Larva_First_Site_2005_month_df['month']==12]
JNorth_Larva_First_Site_2005_12_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [403]:
JNorth_Larva_First_Site_2005_12_df.shape

(0, 6)

In [404]:
JNorth_Larva_First_Site_2005_12_df = pd.DataFrame(JNorth_Larva_First_Site_2005_12_df)
JNorth_Larva_First_Site_2005_12_df.drop(['month'], axis=1, inplace=True)

In [405]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Larva_First_Site_2005_12_df['latitude'] = JNorth_Larva_First_Site_2005_12_df['latitude'].astype(float)
JNorth_Larva_First_Site_2005_12_df['longitude'] = JNorth_Larva_First_Site_2005_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [406]:
geojson = df_to_geojson(JNorth_Larva_First_Site_2005_12_df, cols)

In [407]:
file = open("JNorth_Larva_First_Site_2005_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()